#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-gPJ475xaNPHChWis

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_instance.composer_external: Refreshing state... [id=i-0e1e6f91d3e3bc80a]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_instance.composer_internal: Refreshing state... [id=i-0f70dbd733fc559f9]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-2490098597]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-837377960]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-cbbbac71-b09a-4c4f-a335-24c571a7df71]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-d13a6c7d-8d89-4eeb-ae29-251789490cf1]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0e1e6f91d3e3bc80a" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0e1e6f91d3e3bc80a" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-3-238-230-191.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "3.238.230.191" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9S6aW+kSp4v/N5Sfwem+kjzPDpjmyUzq7K6azRJArmZCBMQQcLcUYnNCUGwFJALdJ/vfhWkq8audfre+2LGErIJ4r///ksYllXZJWV36/R18l4ojqzL6qDp7ovsksR/EcLqWMZB0394Y25MXYUYaAvkvbnhd7ckadqsKt8L0p34p5s/3dzevtz0p5vPvLWsras268a9QdcFUVokZfcX4SljSRkUyYc3WZl1d9HT4c1/UjlNULZPSXOrl1EVZ+XhvfA2zLoXG0aVu+TS3UesOsa3UVU+ZYc/3ZhZkXyj3J9f7rm5ObZJ076/EYRbgWvwXkgi+ZYv3giCILRt+jE4dmnVZEMSf8yTftzLf26FN22b3jZtICwWi4WqgCFYSn0k6/xWW1gLdbFYLBfW8kKfjM2GrZ6W5TyL2Lov3EZXGwfL7GHW5fbKkZL6bbx8HM4S9WZumVrscW/WyWOTgQvYs9W7yIXze2TUaiwOc+MM+t/zp0M6fzr2wJvMN7+bwQz2DlEP0xRUxuUJ7VfTbN1F97bFylA3sl1t5xOW1dXE8ju1Kw6LT4fcXsy0Ie0P4ew4NefZxdlcJq5Kj7YprvbWAGidPPWZe/y93aDfUxk3Vr5bqMfjxrPChrLfjZQUwcOpOfUOlI8t7E6lp9I0fDz38K3sPtKg3sX389QJPj3q0tnoZ9iQy300eTycxUNmhbM2Cw1neAuc5OIqU2v+7lNtQdf0dlF98BtmB+v1zrfNtBvgWzP2G/hg4H1lS4tk0U8OaReBBqoOC6f26fGtMgziJxUZcrSEEyie6+n5/OkxPZ3lsguV2nl47OKk2/5OpqL1WNblvrft0q/lwThHiSyF+8vsbZnOWZk+NP6BJm+jyiofF8blPmLKTLe3/SE7Pkbq+fdceucdmWfu8adA7fLz9iFHVKups5eTqbmVZpX2tt2uo8m9O837p4dTbLYkjT9Jy/16RQish+oQivMp8TIR7Y269NG9lJDD8h797pK+8568d2LzRGAULyp55T+V2+ngIbzfbuemnwfl5aLobzHMcn0L5i2msigOs2Xfi5unzScn3Erq9OntU6wEEWoeJlrk4djY3EtqD9yZIdG3kZ8tVnC7A+GwN0RH6Z7eXcREsj58EIqAVs2/NUmcBt1dVBVvXuM9ieXpVJqPmF9eMc98bSMBR5/ytc2jKlGDTeqZ4ajZZe3MzjCf7d+V9N5/m1SPwNLvTfG8m7yb7oQqPMZB9krYzbnJuuQjrwjPaVkHXfpeuO+K+preH3mN+HgKmnbULLpWgffC358VhbaKNw/axyU0zY3z4Z0SBU/vRDGZylN5Ek6kydPbp2n4NA0SMVaiuSRH7+bSXH6mXkLzEdo6+kw+D+V4OptOJ9O3U1lR3r2dSKGSyEESPL17q8zeJrISvJPjydfCFx+XOnI+PNhi92BLS4TjrZOpGiJbbGN/a4kGRuMzsVvm0tbGSCc60CzX3/uiodh4q/oiI1gDlil7AyDqCudTKZR9MSnMqaPlMlqlOJSRGosIubh+CKV6G6x96uQGQvi8s5ihxqL/CRECrJytLccgCBtKLF4yU5zWvhG3kVRrYO/T0AWKvUqpk0ufrH38SHQycwjyEyzpxAH7YAWgs6/V+FzzZ5NXz3Jj75AtikVSuhi5mBg60g0xLszepkZKlLRxVuI0IfXMEoGKRaYgw/DtvDu5OaviAsDlqPN2ibGh+3JsYN3Qx73uXOP3Vm4Aq1QblxieTYDpDemD69YAE1YmpYogBqopbR/MIt4gTb14e2OI6WHnkS0luSkDZk79PL0gjC8BvhBXf6eY2hYllAyBXFemUl+cNVtjmiqYeacHGWxNd3OJqEoSUjueeAlMKVIIqXvrXIlAQ4WnVIOzZ5PQADMiER9Lamnl7CFYxSpcG13Eatt054Xnoj5ZE9tZdkOY+7rtdhNTiRpvMHY+IUezAK1pxPWSEdHVtmsk+RpiMXBk4+TnqHENoqGSPNjreIfdeOWs0WDrIHBdUMQsdm2jDkA+mcRifDaZEbjOZuoNqRTu1U8mWeyw7reubk78lRE4upS6BsuQowJ7j1xTBxu7VBUksrNXsmNIGA6X3YBKIocaOpGV1Cfr6pTs01mkI5nk0mOUG9vQqieh3CoRIx1ZkxytiIGl7dKRY9XEneRhySZrktp7FYXDNg8V/7IbFhdUeIOFJz3BQI1FolquAYkurdA+3mDC9CXzbVOfLy3GDJRXiu/4nqnkZ381byN7vvOYX3s5q2MZHbG0aEAuLaEeqyYhub2PkYulpYeNlU1jBthhSBw1D+Xz7ge06mdatI8NK5srGPvAwtLScr3J9/Pq8gWj1qFWUVnLQGbMFqNpaNQPUb7pHVcKAt242DozE/eSOgpzIydS0MCWDtliVIKzW2LRXG8UJCHFE1EVFwcJYXCyDSNbFpcmdlQP4Lnni0h212AZreYre72VTb17tN2LAySyM/feGazak81Y6a6jJlzVmKzNE9zX55CmNikuXbTGJyRKj46Dd9jdrvGygwElQTSQAon+PtAniuNsJOx2BGrbXbhOmZ0bLd6nG0u+aHhFJjgHwHOMKdgvFLKallBTH2wWiwlRLWjVIpZjYJULBRBi++47EWA8wXrd2+ViCNbsBIztBJItQnLXJy6w7X1cWHkqB0oK7MI/RrKpuPZcBi6TEE27RJdmSwpEL6+mO7GeImxI9rq6eHksRRh4O8XYYYJwvJyjcPD6OI/3Hs6nWPIfPGZOPJKa1rCFoDRo4G4vEcUTnyLdzq2dXYLWsd8p0RpMI2qcwB6JXr49ApZL1t6cL7NrTUZ4qm90YGCGtihnmkWQca3l4u6bTsELvSWTPl6xInBBGq/wbJktDpulqnt7lMJDddgsF9fL8FlUgjqUJ7ONZh52mjoxs3z35flSdfz9tvbc88EpSecVpH9Ff71kU6sm0Kkm3lCdzaFmwKkLMNQ5GCoRanXuDdXFHCrJ16rBc6qzR6spGO/r3Hfq1HeqC6DVBTp1Bl7pB2pfnqbxmvS+rarhKj5FBRODlTjbrEHlORsJsLiOV6mNRcMIC9Ane1UM3PnxavP1svdgiF3Sw0zVHCqdInkrBe4lfyjmvX9+5Y80XLE82KPpS/rx0qeneKkufdc/RQWebfQ6DbPFxeSXVvXAqXq4XPSmtrls9BiQxdd+UmGoWAfL9UV/vznATN157uRgOgt+zUyKZyY9HEy6GExbXTvEehWH2N1+8l0gwkxloWvUoW7k/nrLIsWchwrIYpe1/or0kaj2vosqb28dPXnevbQDKyQLCkLjpWrF7rYNXPNgy2S60dnRL97NvrHZUCWvuNRerz74+/xguZcyVLbc3x3M1D6Sf+zzF7rbWNQPeE2ycMXoA+5Y4lSHnbY5A+1w8Aom7qxvMDVejjvPY/ciRUO1+97z5+tsanUBaJ37Wk15LKBTp8DhjbGaQq2STFqJgFb8EMGgU1OTVjxmg0l/xldlgHK+1XSML61EX6sL36kU06kGb6hkj9YZcKqBY953OP9K8pya+s5P9Z36XK+RT515TtV7Q6XwXDFpJXN6U6suXO9nXjy3zqPeP+fb+1olg6FSTK2mnK/PfTDUGV8DWl143C/cDloXplaJHq1k06mkn/NVC88Z9ZF9bcxT7osechm0Grh+/ugfrl+dcT09Z8xz0dd+qi/nJZpOXZgDb651YdI653ryNaBVvUd5beA1opp6Ts14nHk9+UXcUm/gPKoBOlznuvCGsTbJQBv9yzxaTcxhtEPxnGtMfTr6+Wf6imN9GjieamYO1cXn8bli7sz19mklwatfe9MZa4LkO9UZ/By/CsemN4x2naHGedeFR0ecXZ55TE2Hx7ZOOW44znyO55/yVZmpVfJzLkx8rU6BVjMwVBP/6pupTzn+auYNIy/Z5Him3K6f++Faw2vG9eZ+5PH2r/nF9ZuA5zoPtEoCtJpwGwAd/f8zviNmzNEX1YX7w6d1ao5yxhiK3HaPY4av871Odea59Au+o7+4P6HG8Tnap5jXHDzz+ECtmnAsm+OzEQ8D0OrU+3ncRN/hOVr1JuW5MGJjAjV+P8oafQ05rnlMuV943tHq8ou4FXDEKa9ddeYNHPfVwGsQx/GIuxEb1xwfc4bjjefFz/M4A9e870ddtGv8AK3OplOn5ljb6pznokfHnn3m+WFqv6oPiwFqY42c8DzweL3SrjMA1HgcRxyfR7w5lQSv/Z/XqNT/aR4veP3LwPn7vQHt03MoT1lYWrON5knAMZXN8nBONP1saovLq55iHCRTY7LZqyxZIxaOM890+HaWUT3gLKYxNQ9WYQy8P1ry/BgpqPdcdozX5myzAn2wR7UnG+0P+p1mOfXKwhcHfdPX/pP/i1489lbb5Xqh2i8Yi2h1+D7vhQy0WkVjPa5XyKl15NRL06l1jjmk1QbvG3zdcuolvPamJccP4Do5lYxobSBaq6ZTa+hn9u+JGKzm3NbpRu9YYqtbf0WO17mSz1KL78du1bHEZTmkzIA5MmCOp5DGOsy9HubWBeZIhXQjwdxYjmuULCHFMqQbGebmBNJ0CelCgdRTILUmMPdXMN+qP/C1Huy30HMlBrP5z2e7F1ckkz5wjRZSsII0GmDOZcUrSGMDUrSCVJcg1QdIfQPm+gXm/nLcN+61epj7OszxBFKuLx6ue6zz8if+HOcsgwyeGzOYqXScY12Qht/Mic/4XrEy2KM0XKpO4MZHb4+kqMDtcyz43FVHq5RFhcRz4JtYuBo+w703bHQyiVfk6K9I/kxLItkofedHGFOxY5gHIpNsYwAWlT6LMlWN96jy3al4PVOwU/gTW19gWw3XiEXFlNPIvq0+x+oH2NERxENNQ1k6hwpgUTZ9Hc/+fED61IElELkfHwpwCvfqicfzoZgPXknqcGUdQ2VbPixV3WHmzNvHw8/2PZ+NXvr46zl3CFZ6Dxx/H+xRhRlQkTulUcnO3/pBTeGYa9XU5GchOvYxOs421xmO9wjeBy+f50hed/m8wPv0OPc440z5yj+ebM7gajPzqT4Dw2IGZDzzncXMd/WZX+AZWG1mppPPTJrPfE2feQ6e+Zo38wp9ZmqHmb/CM+hYr+f7FWGQHjh+e1hsU1j4FFK1gPQwhXTB8zKHND9f95ACFtscUm8CC5LCAveQ8v3RV+dBlfegKe8d41mPz4e8b3GbND4rjbPM2L/5nAius8PU5/1Cq3qfz6N0nG9e2Q9dc+ZTawYcc+YN1sxzDqMvzMKb+S6emQO3E888Gc8gv3f0GdTwzNSimTdE45pPF6/t1xYipGkOC1OEhVHAwhIh1WVYWBNINwOkag4LLMLCu0C6mUAayZAeBkh1EVJPHumodfmqh0z57Olr47mXzw/DeP51xns+d/KeTsHYs+v02r8rmZ+NPVqdfX7WGOoMfjXPmA6eAerNoGPOAPfDaCO3i8fdmoFhM/NkbvNmBpxoBjSOlcPMc7yZN/qN2+99FX+DwsLIIPWmYw2j+RTSbQELfIaFfobUEyHdcFsHSA8SLPQeUnyBFBWQLibj80KXvo4/0OrMvM6pl3FW5veU9/7RD4p5/V+AaD7nAJ/xuL9GXGjjXMnnmtf4d6KZOSxmJrdPxjPTtWYmx/aKn5mjmUe9mV/oox9MniuaNeIdDBw3+QwUHCObr+J/kCGNKaRGBgvEII1ESA0GC3OA1DxDCjJYePK1D0Q9pJseUo6ZjQSpSiFlbKR9HX9+juF5TM1hnIekEQ/OmPMTMNT583lUGs+nPAe43UOdjfP9uMZn9tf28xz3C28GVtbM16wZ0MzRNpPnQYFnHt3MzIKv62Pseb3wtcWID+BsZr7zvfwHKaTR9IrpxfnzP5usnKxtPDlYIrGJzlY2BirR8fjswaqBjZmeuLVmiUZvy7Eai2xpufGWELYNsaTupMNgOuonT8QXU/M14KLcVHSRiHHm7mMdE7az5Xlgu6nsiVMVY2Iu8y2y9vEqyAlx8HaLRP1CMFFjJTY9CmDgon24BoE1ENmTJRqLaeWJUxDkRHEIMhIsYWvPINFzkcjji4MZ2kc7/iwWXz6r1RBLDt7HW1/6Sg+3W6IidV++KHBZukuYsbGLS4DktPJ1UwoOHM+q4suxEWBJNfVYw4qxxiLLTBEhhLcqJkS1HLS1cqRY+7j0RfJgufOtlRsIaZvBE41zZBDHJaRxnY3siQwtc0ny6LaxpBo+yFMDrnSF7CslYHWalIveLUAWKiA39foSi9vK29enQKwVPBhHT5ROMdkovrZoIlJbUCdiYJAilPKdx7Z+iDsQ9d0nLG+XsQtOgCHbzTcTc4inJlE3pt7KQCZdjC3RXBuzRJ/vzSH9hKTtBVAEQpfIwJ7XxBUHsifAt+qZJxrGw2BUjs4cUpClKeUTcxV/CrJ2QMT3It0/RiQN/HzSWKV6dp1tAxxLBO5EiUoAzbzt7VV3cjTyydkbVlIY52WR6qFI3FDy926OzpakLpPCP8XuZoKlVLTkOUF42tpGnfn40vgu2AXiXLP3YGKvPdFcbw3gGttIwUOAwQ5oWAzLaAcMliXYOwVro3PWdelgMEX6YbD1bhsbrDRX2ywWmU9WEvTFuHxQEAQDUN0yJmTFkC8aF9shhS8Dil2JEckQ43Pdm3t9sNwYWLmhIrkufZoqvuwrsYjU8eUTVbFFjM2DuFXtfawi3citIoYkTxHQycqXDOLmrejacxGUh3NIwWnJUjFyCACiftnJ4iku5hSuY4IJ0wnbnIN8a4RK7NjYIGFpKdHKLxxj0wck7uHqIhKxHgJ8WZoF2j4M8SXQ4wsm+c7BWz/Rfd0iYOmLU9fKDeBgs4f72g+Zf/byGMXuZrCLaRkY+snr5/mD7DfQ8A2T+tVuADChqmzK80eUzytTR6pzrkdetqFPrNwooE6WFpY0qzDUWCTKsw9aKzeUWASli9lDLLGlxQxi64aC9rH72S6cbw2wjrGNGVmyvId7RNHAZi5Lt1wvp2A5kS+Dm5tSXIDOx2Ad5pOzS+I81C+dU/qZq29lb9i6Cb5039o12flyWgUra3D2xDcpEz0xmias9uw9+e5LyK9fDFrEMBx9iyyMeE4vLdyVplU3schoUvqGXVo9dgkluqXYsrEx94gm+Dxx9U0D9Hm/k8AkUBZnj6T72I0/+e7lEeSMROVmgjTUWFIaWCLzwGCcltSX7BLQWI8pMtAAcdcTfeoFYndO1uzia0SDLsujdXUmTuqEQ+o8KARgkj6GRbpG+Wbiu3hiEQATvT0R7Iu+XO3QiuBE7zYeRiskbw1M6hkk4CEerD6Q6z7EUkYUo7aLeh/3HY7x1g3dtscFWYE9IJ4CLpbknR0NnSO2deHemEaHOiX5PHCWneZLtYaLuvJwbZN1XAWKmmOlvuACoUhZKJ4LJk5ubMKsE8mqU501u3hKrIYU5bYciWGJ5GjNLJsAsizMU7gmIJSqCRpyydTTwdnHjw8Sw57MtgjXKHHJ2hz8Kh7Q0uvnHRYPPcprFxfARWuwJ7mf+jQ6kRWy0QpMgqzdRXJ+sZgxJMzoTHxpQ106AzdWLEfcPb8kN5zc+kEPrD58/dLFth8+7nTP/rhA4EPQlO+Dc/u+TaIm6doiKIND0rw/trdJ0Ha30vu5orydytL87Xw+f971Prl0SVMG7GNUFXXVJs34ec/tYaqLB+dZnI1Ve4k2j84Ggo/mAixWz18GLID2fy65PYZt1GR1l1Xl7TPJbVQVRVDGt7nlsWr+Wb5nO7r5cQ1tByxM/UPbBYesPNx+1v32s+53wbm9+3JTteExY/Fd1Ry+9pu2QR/uky66f97zhcNnifoS6Y79xVgdaI9wA5yPGD18SLuubt/f37+29u6LtXdBEQxV+azL/cvPN74n8puFu64q2Pe/6vj3vKLZfzzfBIxV5yT+GFdFkJWt8EH4d+FNlwTFS8vf/IvwJj2Gd2GTnL9eP1dNnjTfPhI+S4gC4YPw5vtaR8Ft1HR3dVK8ufms3ZXhP6zf/zM9fvzR3T/y+dzltk0Txq7g/NH3c/90H2blfRi06U2bdMJtcqyEOquTpyBjN211bKLk+1/r3PxZsJNO6NJEaPu2SwohrdquDIrk7ubzX1HHhDbpbj/fC799lQL/UyxFySFru6QZzc3KtgvKKBHOWZcKaA3ubu6PbXPPqihgo5Dg3Aqvs0o4JN3tden2FLBjIvwvnk+fl7JY+O1vvypPfwh/F+gn4bYR3tzZI53dNVl5eCP861Xxl5Xo47Pgj8+V6I62VXnzmfxnO9/8F5kJfxdGZzaFcPv0X1Xgf0i8taRmVT9G+zlRheVCiJKmy56yKOiSu5swaJPZRLiNhVvhr3/9q/Db3776WuwP4V+F3/72slT/8SLJv5LyuQz8SsarzxS+K+GZ0a/k5En/fwHbpIzrKiu722PDOHJ/0mb++A7Sv9v3fwnvV539NZ5fPnrzo91XwH5x6E98x53DffcC2t8R/t8Fyze6an+0HYgWK/3DfZyc7stTkUildGM7C0e/DgmnoLlnWfjtoPBcx4+10HZVExwSoSq/wOTuJnsS/kk4NEnNw/yZ3R/Cfd1U0X1RHcuu/QtHVnkjCH8W9LI9Nomgq7aQtcLTkbGeN/8yibokFp6ypu3ubgThqWoEZ2PqSMhK4W/i3Z0iin/8RYirsU9mT0LbBZ3w2wu7vsjgP2GTBPn491N2/bCbJUktSDeCEFdlcjOqskyTKOe89oY9fpL+3KWyVghYkwRxLxRBnHB1RhsvT+3HrHyqfiS2yJ/au8tT++r5zajCKM8M8i/F4ot3R0MSIc6aJOqqpueiiqxts/LABRd5nDXC7WvfXtkt4ljoquuk9dR2QSgEZSyMDueUSZRWwpvf/vZClz9eR4irGidPwZF1rSAK4hvh70KXJMJt8IIp14GzfG3UqABKONJs/SErj5frBHfpWi67SThSkqgqhVt0Ej5D60rGsfTC23XSjPZW5UgapdWZUwkfv/bU+29WvuMUkjTZEy9kwfPg8YzYrBXOTdYFIUtuBKGrjlH6ivr+rm6qU8bVyMrDx4hDgxsypvcvNz5l/21S/RdtaxHTY9v9Z5HvKoHxuaXkOR0IZVXe8tElDppYqKumu3oyawWWtK3AsjxhPScKk5s/C20UlGUSj7irmypM4rubPwsO1OD/V6RBHyfl//9ecBOhTPimKOIsODSaLOL9v+UyeZDKpOODscCSU8KEoBPaquD8xwbyL0J47IRzwhP3nzshDU6JkHVCkx3STiir893NlxwZUXuFVfz8+5tqdhvU2V1bRXnS3cX3Nxzv/zhZdUqaJouTu6gqn3jzGUvqkTHhr38VdGjc/Ls9bv2Pm4fRuXbXJEHx4fXd/N3b2Q3ffBXJJ+E4SIqqvG0SVgUxD9djk9RB823V+GfuyKLqEuF6ohDapDllUdKOsbjq2d694FwEbf6Fy5Xm36S7Z6oX+5KSp4hwe1tW5y/7r6KeyZ698Cua7zjumxy5vf3Tzf8OAAD//8oAS3uINAAA" -> "H4sIAAAAAAAA/9S6aZObSpov/r4i+jsw7hMx/3+cqSoWSbbc7YkRArQVmUVCJoK+Ew62EiTJYkALnD7f/UaisrvK25m+976YcQRhk/nks/6eJS2WVdklZXfr9HXyXiiOrMvqoOnui+ySxH8RwupYxkHTf3hjbkxdhRhoC+S9ueFvtyRp2qwq3wvSnfinmz/d3N6+JPrTzWfeWtbWVZt1I23QdUGUFknZ/UV4ylhSBkXy4U1WZt1d9HR4849TThOU7VPS3OplVMVZeXgvvA2z7gXBqHKXXLr7iFXH+Daqyqfs8KcbMyuSb5T780uam5tjmzTt+xtBuBW4Bu+FJJJv+eKNIAhC26Yfg2OXVk02JPHHPOlHWv7nVnjTtult0wbCYrFYqAoYgqXUR7LOX7WFtVAXi8VyYS0v9MnYbNjqaVnOs4it+8JtdLVxsMweZl1urxwpqd/Gy8fhLFFv5papxR73Zp08Nhm4gD1bvYtcOL9HRq3G4jA3zqD/NX86pPOnYw+8yXzzqxnMYO8Q9TBNQWVcntB+Nc3WXXRvW6wMdSPb1XY+YVldTSy/U7visPh0yO3FTBvS/hDOjlNznl2czWXiqvRom+Jqbw2A1slTn7nHX9sN+jWVcWPlu4V6PG48K2wo+9VISRE8nJpT70D52MLuVHoqTcPHcw/fyu4jDepdfD9PneDToy6djX6GDbncR5PHw1k8ZFY4a7PQcIa3wEkurjK15u8+1RZ0TW8X1Qe/YXawXu9820y7Ab41Y7+BDwbeV7a0SBb95JB2EWig6rBwap8e3yrDIH5SkSFHSziB4rmens+fHtPTWS67UKmdh8cuTrrtr2QqWo9lXe572y79Wh6Mc5TIUri/zN6W6ZyV6UPjH2jyNqqs8nFhXO4jpsx0e9sfsuNjpJ5/zaV33pF55h5/CtQuP28fckS1mjp7OZmaW2lWaW/b7Tqa3LvTvH96OMVmS9L4k7Tcr1eEwHqoDqE4nxIvE9HeqEsf3UsJOSzv0a8u6TvvyXsnNk8ERvGiklf+U7mdDh7C++12bvp5UF4uiv4WwyzXt2DeYiqL4jBb9r24edp8csKtpE6f3j7FShCh5mGiRR6Ojc29pPbAnRkSfRv52WIFtzsQDntDdJTu6d1FTCTrwwehCGjV/EeTxGnQ3UVV8eY13pNYnk6l+Yj55RXzzNc2EnD0KV/bPKoSNdiknhmOml3WzuwM89n+XUnv/bdJ9Qgs/d4Uz7vJu+lOqMJjHGSvhN2cm6xLPvKK8JyWddCl74X7rqiv6f2R14iPp6BpR82iaxV4L/z9WVFoq3jzoH1cQtPcOB/eKVHw9E4Uk6k8lSfhRJo8vX2ahk/TIBFjJZpLcvRuLs3l59NLaD5CW0efj89DOZ7OptPJ9O1UVpR3bydSqCRykARP794qs7eJrATv5HjytfDFx6WOnA8Pttg92NIS4XjrZKqGyBbb2N9aooHRuCd2y1za2hjpRAea5fp7XzQUG29VX2QEa8AyZW8ARF3hfCqFsi8mhTl1tFxGqxSHMlJjESEX1w+hVG+DtU+d3EAIn3cWM9RY9D8hQoCVs7XlGARhQ4nFS2aK09o34jaSag3sfRq6QLFXKXVy6ZO1jx+JTmYOQX6CJZ04YB+sAHT2tRqfa743ebWXG3uHbFEsktLFyMXE0JFuiHFh9jY1UqKkjbMSpwmpZ5YIVCwyBRmGb+fdyc1ZFRcALkedt0uMDd2XYwPrhj7SunONv1u5AaxSbVxieDYBpjekD65bA0xYmZQqghioprR9MIt4gzT14u2NIaaHnUe2lOSmDJg59fP0gjC+BPhCXP2dYmpblFAyBHJdmUp9cdZsjWmqYOadHmSwNd3NJaIqSUjteOIlMKVIIaTurXMlAg0VnlINzp5NQgPMiER8LKmllbOHYBWrcG10Eatt050Xnov6ZE1sZ9kNYe7rtttNTCVqvMHY+YQczQK0phHXS0ZEV9uukeRriMXAkY2Tn6PGNYiGSvJgr+MdduOVs0aDrYPAdUERs9i1jToA+WQSi/HZZEbgOpupN6RSuFc/mWSxw7rfuro58VdG4OhS6hosQ44K7D1yTR1s7FJVkMjOXsmOIWE4XHYDKokcauhEVlKfrKtTsk9nkY5kkkuPUW5sQ6uehHKrRIx0ZE1ytCIGlrZLR45VE3eShyWbrElq71UUDts8VPzLblhcUOENFp70BAM1FolquQYkurRC+3iDCdOXzLdNfb60GDNQXim+43umkp/91byN7PnOY37t5ayOZXTE0qIBubSEeqyahOT2PkYulpYeNlY2jRlghyFx1DyUz7sfnFU/n0X72LCyuYKxDywsLS3Xm3w/ry5fMGodahWVtQxkxmwxmoZG/RDlm95xpSDQjYutMzNxL6mjMDdyIgUNbOmQLUYlOLslFs31RkESUjwRVXFxkBAGJ9swsmVxaWJH9QCee76IZHcNltFqvrLXW9nUu0fbvThAIjtz753Bqj3ZjJXuOmrCVY3J2jzBfX0OaWqT4tJFa3xCovToOHiH3e0aLzsYUBJEAymQ6O8DfaI4zkbCbkegtt2F65TZudHifbqx5IuGV2SCcwA8x5iC/UIhq2kJNfXBZrGYENWCVi1iOQZWuVAAIbbvvhMBxhOs171dLoZgzU7A2E4g2SIkd33iAtvex4WVp3KgpMAu/GMkm4prz2XgMgnRtEt0abakQPTyaroT6ynChmSvq4uXx1KEgbdTjB0mCMfLOQoHr4/zeO/hfIol/8Fj5sQjqWkNWwhKgwbu9hJRPPEp0u3c2tklaB37nRKtwTSixgnskejl2yNguWTtzfkyu9ZkhKf6RgcGZmiLcqZZBBnXWi7uvukUvNBbMunjFSsCF6TxCs+W2eKwWaq6t0cpPFSHzXJxfQyfRSWoQ3ky22jmYaepEzPLd1/2l6rj77e1554PTkk6ryD9q/PXRza1agKdauIN1dkcagacugBDnYOhEqFW595QXcyhknytGjynOnu0moLxvc59p059p7oAWl2gU2fglX6g9uVpGq9J79uqGq7iU1QwMViJs80aVJ6zkQCL63iV2lg0jLAAfbJXxcCdH682Xx97D4bYJT3MVM2h0imSt1LgXvKHYt7751f+SMMVy4M9mr48Pz769BQv1aXv+qeowLONXqdhtriY/NGqHjhVD5eL3tQ2l40eA7L42k8qDBXrYLm+6O83B5ipO8+dHExnwZ+ZSfHMpIeDSReDaatrh1iv4hC720++C0SYqSx0jTrUjdxfb1mkmPNQAVnsstZfkT4S1d53UeXtraMnz7uXdmCFZEFBaLxUrdjdtoFrHmyZTDc6O/rFu9k3Nhuq5BWX2uvVB3+fHyz3UobKlvu7g5naR/KPff5CdxuL+gGvSRauGH3AHUuc6rDTNmegHQ5ewcSd9Q2mxsdx53nsXqRoqHbf239+zqZWF4DWua/VlMcCOnUKHN4YqynUKsmklQhoxS8RDDo1NWnFYzaY9Gd8VQYo51tNx/jSSvS1uvCdSjGdavCGSvZonQGnGjjmfYfzryTPqanv/FTfqc/1GvnUmedUvTdUCs8Vk1YyP29q1YXr/cyL59Z51PvnfHtfq2QwVIqp1ZTz9bkPhjrja0CrC4/7hdtB68LUKtGjlWw6lfRzvmrhOaM+sq+Necp90UMug1YD188f/cP1qzOup+eMeS762k/15bxE06kLc+DNtS5MWudcT74GtKr3KK8NvEZUU8+pGY8zryd/ELfUGziPaoAO17kuvGGsTTLQRv8yj1YTcxjtUDznGlOfjn7+mb7iWJ8GjqeamUN18Xl8rpg7c719Wknw6tfedMaaIPlOdQY/x6/CsekNo11nqHHedeHREWeXZx5T0+GxrVOOG44zn+P5p3xVZmqV/JwLE1+rU6DVDAzVxL/6ZupTjr+aecPISzY5nim36+d+uNbwmnG9uR95vP1rfnH9JuC5zgOtkgCtJtwGQEf//4zviBlz9EV14f7waZ2ao5wxhiK33eOY4euc1qnOPJf+gO/oL+5PqHF8jvYp5jUHzzw+UKsmHMvmuDfiYQBanXo/j5voOzxHq96kPBdGbEygxt9HWaOvIcc1jyn3C887Wl3+IG4FHHHKa1edeQPHfTXwGsRxPOJuxMY1x8ec4XjjefHzPM7ANe/7URftGj9Aq7Pp1Kk51rY657no0bFnn3l+mNof1YfFALWxRk54Hni8XmnXGQBqPI4jjs8j3pxKgtf+z2tU6v80jxe8/mXg/P3egPbpOZSnLCyt2UbzJOCYymZ5OCeafja1xeVVTzEOkqkx2exVlqwRC8eZZzp8O8uoHnAW05iaB6swBt4fLXl+jBTUey47xmtztlmBPtij2pON9gf9TrOcemXhi4O+6Wv/4P+iF4+91Xa5Xqj2C8YiWh2+z3shA61W0ViP6xVyah059dJ0ap1jDmm1wfsGX7ecegmvvWnJ8QO4Tk4lI1obiNaq6dQa+pn9eyIGqzm3dbrRO5bY6tZfkeN1ruSz1OL7sVt1LHFZDikzYI4MmOMppLEOc6+HuXWBOVIh3UgwN5bjGiVLSLEM6UaGuTmBNF1CulAg9RRIrQnM/RXMt+oPfK0H+y30XInBbP7z2e7FE8mkD1yjhRSsII0GmHNZ8QrS2IAUrSDVJUj1AVLfgLl+gbm/HOlGWquHua/DHE8g5fri4UpjnZc/8ec4Zxlk8NyYwUyl4xzrgjT8Zk58xveKlcEepeFSdQI3Pnp7JEUFbp9jweeuOlqlLCokngPfxMLV8BnuvWGjk0m8Ikd/RfLnsySSjdJ3foQxFTuGeSAyyTYGYFHpsyhT1XiPKt+ditc7BTuFP7H1BbbVcI1YVEz5Gdm31edY/QA7OoJ4qGkoS+dQASzKpq/j2Z8PSJ86sAQi9+NDAU7hXj3xeD4U88ErSR2urGOobMuHpao7zJx5+3j4Gd3z3eilj7+ec4dgpffA8ffBHlWYARW5UxqV7PytH9QUjrlWTU1+F6JjH6PjbHOd4XiP4H3w8nmO5HWXzwu8T49zjzPOlK/848nmDK42M5/qMzAsZkDGM99ZzHxXn/kFnoHVZmY6+cyk+czX9Jnn4JmveTOv0Gemdpj5KzyDjvV6vl8RBumB47eHxTaFhU8hVQtID1NIFzwvc0jz85WGFLDY5pB6E1iQFBa4h5TTR1/dB1Xeg6a8d4x3PT4f8r7FbdL4rDTOMmP/5nMiuM4OU5/3C63qfT6P0nG+eWU/dM2ZT60ZcMyZN1gzzzmMvjALb+a7eGYO3E4882Q8g/zd0WdQwzNTi2beEI1rPl28tl9biJCmOSxMERZGAQtLhFSXYWFNIN0MkKo5LLAIC+8C6WYCaSRDehgg1UVIPXk8R63LVz1kymdPXxvvvXx+GMb7rzO+87mT93QKxp5dp9f+Xcn8buzR6uzzu8ZQZ/CrecZ08AxQbwYdcwa4H0YbuV087tYMDJuZJ3ObNzPgRDOgcawcZp7jzbzRb9x+76v4GxQWRgapNx1rGM2nkG4LWOAzLPQzpJ4I6YbbOkB6kGCh95DiC6SogHQxGfcLXfo6/kCrM/M6p17GWZm/U977Rz8o5vX/AkTzOQf4jMf9NeJCG+dKPte8xr8TzcxhMTO5fTKema41Mzm2V/zOHM086s38Qh/9YPJc0awR72DguMlnoOAY2XwV/4MMaUwhNTJYIAZpJEJqMFiYA6TmGVKQwcKTr30g6iHd9JByzGwkSFUKKWPj2dfx5/cYnsfUHMZ5SBrx4Iw5PwFDnT/fR6XxfspzgNs91Nk4349rfGZ/bT/Pcb/wZmBlzXzNmgHNHG0zeR4UeObRzcws+Lo+xp7XC19bjPgAzmbmO9/Lf5BCGk2vmF6cP/9nk5WTtY0nB0skNtHZysZAJToe9x6sGtiY6Ylba5Zo9LYcq7HIlpYbbwlh2xBL6k46DKajfvJEfDE1XwMuyk1FF4kYZ+4+1jFhO1ueB7abyp44VTEm5jLfImsfr4KcEAdvt0jULwQTNVZi06MABi7ah2sQWAORPVmisZhWnjgFQU4UhyAjwRK29gwSPReJPP5wMEP7aMf3YvHlXq2GWHLwPt760ld6uN0SFan78ocCl6W7hBkbu7gESE4rXzel4MDxrCq+HBsBllRTjzWsGGsssswUEUJ4q2JCVMtBWytHirWPS18kD5Y731q5gZC2GTzROEcGcVxCGtfZyJ7I0DKXJI9uG0uq4YM8NeBKV8i+UgJWp0m56N0CZKECclOvL7G4rbx9fQrEWsGDcfRE6RSTjeJriyYitQV1IgYGKUIp33ls64e4A1HffcLydhm74AQYst18MzGHeGoSdWPqrQxk0sXYEs21MUv0+d4c0k9I2l4ARSB0iQzseU1ccSB7AnyrnnmiYTwMRuXozCEFWZpSPjFX8acgawdEfC/S/WNE0sDPJ41VqmfX2TbAsUTgTpSoBNDM295edSdHI5+cvWElhXFeFqkeisQNJX/v5uhsSeoyKfxT7G4mWEpFS54ThKetbdSZjy+N74JdIM41ew8m9toTzfXWAK6xjRQ8BBjsgIbFsIx2wGBZgr1TsDY6Z12XDgZTpB8GW++2scFKc7XNYpH5ZCVBX4zLBwVBMADVLWNCVgz5onGxHVL4MqDYlRiRDDE+17251wfLjYGVGyqS69KnqeLLvhKLSB1/fKIqtoixeRC3qr2PVaQbuVXEkOQpAjpZ+ZJB3LwVXXsugvJwDik4LVkqRg4BQNQvO1k8xcWcwnVMMGE6YZtzkG+NUIkdGxskLC0lWvmFY2z6gMQ9XF1EItZDgC9Ls0DbhyG+BHp8wSTfOXjrJ7qvWwQsfXHqWrkBHGz2cF/7IfPPXh6j2N0MdjEtA0M/ef08f5D9Bhq+YVK/2g0AJlSVTXn+iPJ5ZepIdc71yMs29ImVGwXUydLCkmYVhhqLRHn2QWvlhhKLoHQxe4gltrSYQWzdUNA+dj/bhfOtAdYxtjEjS5b3cI8oGtjMZemW6+UULCfyZXBzU4oL0PkYrMN8cnZJnIf6pXNKP3P1rewNWzfBl+5buyY7X06rYGUNzp74JmWiJ0bThNWevSff/RHy6x8GLWIYjr5FFkY8p5cW7krTqptYZDQpfcMurR67hBLdUmzZ2Jh7RBN8nrj6pgH6vN9JYBIoi7NH0n3sxp989/IIckaicjNBGmosKQ0skXlgME5L6kt2CWisxxQZaIC464k+9QKxOydrdvE1okGX5dG6OhMndcIhdR4UAjBJH8MiXaN8M/FdPLEIgInengj2RV+udmhFcKJ3Gw+jFZK3Bib1DBLwEA9WH8h1H2IpI4pR20W9j/sOx3jrhm7b44KswB4QTwEXS/LOjobOEdu6cG9Mo0OdknweOMtO86Vaw0Vdebi2yTquAkXNsVJfcIFQpCwUzwUTJzc2YdaJZNWpzppdPCVWQ4pyW47EsERytGaWTQBZFuYpXBMQStUEDblk6ung7OPHB4lhT2ZbhGuUuGRtDn4VD2jp9fMOi4ce5bWLC+CiNdiT3E99Gp3ICtloBSZB1u4iOb9YzBgSZnQmvrShLp2BGyuWI+6efyQ3nNz6QQ+sPnz9o4ttP3zc6Z79cYHAh6Ap3wfn9n2bRE3StUVQBoekeX9sb5Og7W6l93NFeTuVpfnb+Xz+TPU+uXRJUwbsY1QVddUmzfh5z+1hqosH51mcjVV7iTaPzgaCj+YCLFbPXwYsgPZ/Lrk9hm3UZHWXVeXt85HbqCqKoIxvc8tj1fyzfM92dPPjGtoOWJj6h7YLDll5uP2s++1n3e+Cc3v35aVqw2PG4ruqOXztN22DPtwnXXT/TPOFw2eJ+hLpjv3FWB1oj3ADnI8YPXxIu65u39/fv7b27ou1d0ERDFX5rMv9y883vifym4W7rirY97/q+Fte0ew/n18CxqpzEn+MqyLIylb4IPxNeNMlQfHS8jf/JrxJj+Fd2CTnr9fPVZMnzbdbwmcJUSB8EN58X+souI2a7q5Oijc3n7W7Mvyn9ft/psePP7r7Zz6fu9y2acLYFZw/+n7uX+7DrLwPgza9aZNOuE2OlVBndfIUZOymrY5NlHz/a52bJEor4Y2ddF1WHoS2b7ukENKq7cqgSO7e3Nz8WbCTTujS5JvNm8//ijomtEl3+/ld+OWrHPkf5YprIQi5O7Ky7YIySoSuEtAaXN2BkkPWdkkz+uQLxTnr0pHm5v7YNvesigI2ahKcW+F1bgqHpLu9Lt2eAnZMhP/Fs/LzUhYLv/z2R0Xud+HvAv0k3DbCmzt7PGd3TVYe3gj/frXuZT37+Cz443M9u6NtVd58Pv4zyjf/RWbC34XR400h3D79VxW4+V7Nff4GVbi9DY5d9T8JOFpSs6rnsOE9SwjKWIiSpsuesijokvYKnivRCJ3n2iEsFy/p7m7CoE1mE+E2Fm6Fv/71r8Ivv331Advvwr8Lv/z2snv8/qLufCXlc2X6Ixmvvpz4roRnRn8kJ0/6/4scSMq4rrKyuz02jKfBTzrf799Jm++OIn+YK6+GjdfJ8XLrzY+or+j/4tCf+I47h/vuRZ58R/h/F9Df6Kr90XYgWqz0D/dxcrovT0UildKN7Swc/Tq3nILmnmXht7PLV63lWP8DI21XNcHhRXs51p/XhKr8Qnd3kz0J/yIcmqTmWPgs83fhvm6q6L6ojmXX/oXDr7wRhD8Letkem0TQVVvIWuHpyFjPh5YyibokFp6ypu3ubgThqWoEZ2PqSMhK4Tfx7k4Rxd//IsTV2N+zJ6Htgk745YXxX2TwP2GTBPn476fs+kE6S5JakG4EIa7K5GZUZZkmUc557Q17/JT+uXlmrRCwJgniXiiCOOHqjDZentqPWflU/UhskT+1d5en9tX+zajCKM8M8i8V5faFn4MuEeKsSaKuanouqsjaNisPXHCRx1kj3L727ZXdIo55zxtnnKe2C8KxnI0O5yevkf3ltxe6/P46QlzVOHkKjqxrBVEQ3wh/F7okEW6DF0y5Dpzla6NGBVDC4WjrD1l5vFwnz0vXctlNwpGSRFUp3KKT8Bl/12McSy+8XSfNaG9VjkejtDrzU8LHrz31/puV7ziFJE32xKtd8DwPPSM2a4Vzk3VByJIbQeiqY5S+On1/VzfVKeNqZOXhY8ShwQ0Za8AfEj5l/23qwT8xSL7K9qQ5ZdHnDriI6bHt/rHbVQLj81TJMz8Qyqq85SNVHDSxUFdNd/V31gosaVuBZXnCen4oTG7+LLRRUJZJPKKzbqowie9u/iw4UIP/X5EGfZyU//97wU2EMuFEUcRZcAA1WcSHjpbL5KEsk46P/QJLTgkTgk5oq4LzH3vRvwnhsRPOCU/vf+2ENDglQtYJTXZIO6Gsznc3XzJpxPYVfPHz398Uxtugzu7aKsqT7i6+v+FZ8c8fq05J02RxchdV5RPvY2N1PjIm/PWvgg6Nm7/ZI+l/3jyMzrW7JgmKD6/f5u/ezm448VUkH+PjICmq8rZJWBXEPFyPTVIHzbe15V+5I4uqS4TrfelLlMdYXPVs715wLoI2/8LleuY/pLvnUy/okpInknB7W1bnL/RXUc/Hnr3wR2e+47hvMun29k83/zsAAP//b15njWY1AAA=" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-025f2b6183125ffe3" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0f70dbd733fc559f9" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0f70dbd733fc559f9" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9S6aZOcSJYu/D3N+j8w6jKb97WazGSJIBXq1tgEAcSWuCeLO8vcMRlbBjjOIiAW6K7/fs2JlCZTUqmm770fZmSGVeHL8XOe85zFM1jVVZ9W/a0zNOkHrjzSPm/Ctr8v80ua/IWL6mOVhO3w8Z2xNTQFIqAuLf/dDXu7xWnb5XX1gRPu+D/d/Onm9vb1oj/dfJGt5l1Td3k/rQ37PoyzMq36v3DPOU2rsEw/vsurvL+Lnw/v/nOX04ZV95y2t1oV10leHT5wD1Hev1owqdynl/4+pvUxuY3r6jk//OnGyMv0O+X+/HrNzc2xS9vuww3H3XJMgw9cGou3bPCG4ziu67JP4bHP6jYf0+RTkQ7TWvbvlnvXddlt24XccrlcKhIYw5UwxKLGXtWluVSWy+Vqaa4u5Fnfbun6eVUt8phuhtJtNaV1kEgf5b6w146QNg/J6mk8C8SX3Soz6ZNnNOlTm4ML8Oj6fezCxb2lN0rCjwv9DIZfi+dDtng+DsCfLba/GqEMBwcrh3kGav3ybHnreb7p43vbpFWk6fm+sYsZzZt6Zga90peH5edDYS9ldcyGQyQf58Yivzjby8xVyNE2+LVnjoA06fOQu8dfu631ayai1iz2S+V43Ppm1BL6q57hMnw8tafBgeKxg/2p8hWSRU/nAT6I7hMJm31yv8ic8POTJpz1QUa6WHnx7Olw5g+5GcldHunO+ACc9OJKc3Px/nNjQtfw93FzCFpqh5vNPrCNrB/hg5EELXzUkVfbwjJdDrND1seghYpDo7l9enqQxpH/rFi6GK/gDPLnZn4+f37KTmex6iOpcR6f+iTtd7/iOW8+VU3lDbZdBY046uc4FYXIu8gPVbagVfbYBgeSPsS1WT0t9ct9TCVZs3fDIT8+xcr510J47x+pb3joc6j0xXn3WFhEbYjjienc2AlyrT50u008u3fnxfD8eEqMDmfJZ2HlbdYYw2asDxG/mGM/5y1Pb6rAuhdSfFjdW7+6eOj9Z/893z5jGCfLWlwHz9VuPvoW8na7hREUYXW5SNoDgnmh7cCiQ0Tk+VFeDQO/fd5+dqKdoMyfH54TKYyt9nGmxj5K9O29oAzAlXWBPMRBvlzD3R5Eo6fzjtQ/v7/wqWB+/MiVIanbf2vTJAv7u7gu373le5qI87mwmDi/unKeBupWAI42Z2PbJ0UgOp01su4o+WXjyGdYyN77itwHD2n9BEzt3uDP+9n7+Z6ro2MS5m8Ouzm3eZ9+YhnhJSybsM8+cPd92VzD+xPLEZ9OYdtNmsXXLPCB+/uLotBW0PZR/bSChrF1Pr6X4vD5Pc+nc3EuzqKZMHt+eJ5Hz/Mw5RMpXghi/H4hLMSX3StoPEFbs75sX0RiMpfn89n8YS5K0vuHmRBJqRim4fP7B0l+SEUpfC8ms28PX35aaZbz8dHm+0dbWFko2Tm5olp4h2wU7ExeR9Y0x/erQtjZyNKwBlTTDbyA1yUb7ZSApxipwDREfwRYWaNiLkRiwKelMXfUQrTWGYpES0l4y3JR8xgJzS7cBMQpdMtC571JdSXhg88WxsAs6MZ0dGwhXUr4S27w8ybQky4WGhV4AYlcINnrjDiF8Nn0kiesYdnBVpAiQcMO8MI1gI7XKMm5YXOzN3OF7jl4ZyU8rlxkuQjrmqXpfFIag030DEtZ66z5eYob2eSBgngqWboe2EV/cgtaJyWAq0nn3QohXQvEREeark1r3YXK3s1CB2altC7WfRsDwx+zR9dtAMK0SivFgggohrB7NMpka6nKxff0MSGHvY93BBeGCKgxD4rsYiF0CdEFu9p7yVB3VkrwGIpNbUjNxdnQDSKZhKh/ehTBznC3l5goOMWN4/OX0BBiCeNmMM81D1Sr9KV6dDw6i3QgYwEHSFAqs6CP4TpR4EbvY9rYhrsofdca0g22nVU/RkWg2W4/M6S49Ud9H2B8NErQGXrSrCjmXXW3sYRAtWgCHFE/BYXVujpWrQo/2ptkj9xk7Wys0dZA6LqgTGji2noTgmI2S/jkbFA9dJ3t3B8zIfKUzwZe7pEWdK5mzIK1HjqakLk6zS1HAbZnuYYGtnalSBZPz35FjxGmKFr1o1VhMVKtE14LQ7qpT6mXybFmibgQnuJC30VmM4vEToop7vEGF9Ya60jYrRwxUQzUCz4SbLzBme0pVjTuikgKLvtxebFKfzTRbMAIKAmPFdPVIdaEteUlW4SptqKBbWiLlUmpbhW1FDiBb0jFOVgvuthe7H0aNH5Bm0S0jkhYtqAQVlBLFAPjwvYSy0XCykf62iYJBfQwpo5SROJ5/zt7lS97LS/RzXwhIRQAEwkr0/VnP46ry1eOmodGsapGBCKlNh/PI715jIvt4LhCGGr6xdaokbqXzJGoGzuxZI105eAdsipwdivEG5utZAmW5PNWnZQHwULgZOt6viovbeIoPkALP+At0d2AVbxerO3NTjS0/sl2Lw4Q8N7w/DNYdyeb0srdxG20bhDeGCfoNeeIZDYuL328QSeLF54cB+2Ru9ugVQ9DgsN4xKXFB16ozSTH2QrI7TFUd/tok1G70DvkZVtTvKhojWeoAMB39DnwlhJezyuoKo82TfgUKyY0Gx6JCTCrpQQwtgP3PQ8QmiGtGexqOYYbegL6bgbxzrLEfkhdYNteUppFJoZSBuwyOMaiIbn2QgQuFSyS9akmyCsCeL+o53u+mVtIF+xNffGLRIgR8PeSvkfYQslqYUWjPyRF4vmomCMhePSpMfNxZpjjDoJKJ6G7u8QEzQJiaXZh7u0KdI79Xoo3YB4T/QQ8i/eL3RHQQjA9Y7HKrznZQnNtqwEdUWtnFVQ1saVfczm//65SsERvinhI1rQMXZAlaySv8uVhu1I037MyeKgP29Xy+ugBjSvQROJM3qrGYa8qMyMv9l/nV4oTeLvGd88Hp8K9X+Lhzf7rIxpqPYNOPfPH+myMDQVOU4KxKcBY81BtCn+sL8ZYC4Faj75Tn31Sz8H03hSB02SBU18AqS/QaXLwRj/QBOI8SzZ4CGxFidbJKS4pH655ebsBte9sBUCTJllnNuJ1PSrBkHoKH7qL49Xm62N7YExcPMBcUR0inGJxJ4TupXgsF0NwfoNHFq1pEXrW/PX+6dHmp2SlrAI3OMUlkrdak0X58mKwR60H4NQDXC0HQ91etloC8PJbnBQYSebBdAM+8LYHmCt7350dDGfJHtkgSDbI4WCQ5WjYysbB5hs/JO7uc+ACHuYKjVy9iTS9CDY7GkvGIpJAnri0C9Z4iHllCFyr9j3z6IuL/rUdSMJ5WGKSrBQzcXdd6BoHW8TzrUaPQfle/s5mXRH88tL4g/IYeMXBdC9VJO0Y3j3MlSEWfx/zV7rbiNcOaIPzaE3JI+pp6tSHvbo9A/Vw8EvK783vODU9jrsoEvcixGO9/9H8y3M21KYEpCkCtSHMF9BpMuCwwljPoVoLBql5QGp2iaDQaYhBauaz0SA/k6tQQJjcej75l9R8oDZl4NSS4dSjP9aiT5ocOPXIOB84TH4t+E5DAuen+s4Dptckp8l9px78sZZYrBikFtl+Q60vTO8XWSy2zpPeP5c7BGotgrGWDLUhTG7AMBibnI0BtSl9hguzgzSloda8T2rRcGrh53KV0ncmfcRAneKUYTFAdgapR6ZfMOHD9GtypqfvTHHOB+pP9WWyeMNpSmNkxbUpDdIUTE82BtR68AnLDSxH1HPfaSjzM8snf+C3zB+ZjHqEDtO5Kf1xyk0iUCd8qU/qmTFOdki+c/VpQCacf6YvP+WnkfGpocZYXwLmnyvnzkzvgNQCvOI6GM6UE4TAqc/g5/yVGDf9cbLrDFUmuyl9MvHs8iJjbjjMt03GeMN4FjA+/1SuQg21Fl9iYRaoTQbUhoKxngVXbOYBYfxrqD9OskSD8Zkwu36OwzWHN5TpzXBk/g6u8cX0m4GXPA/UWgCknjEbAJnw/5nciTPGhEV9YXgEpMmM6ZzJhzyz3WecYeNsrVOfWSz9gdwJL4YnVBk/J/sk4xqDZ+YfqNYzxmVjmpv4MAK1yfyf+40PHBaj9WAQFgsTN2ZQZe/TWRPWkPGa+ZThwuKO1Jc/8FsJJ56y3NXk/sh4X48sBzEeT7ybuHGN8SlmGN9YXPw8jnNwjfth0kW9+g+Q+mw4TWZMua0pWCz6ZKrZZxYfhvpH+WE5QnXKkTMWBz7LV+q1B4Aq8+PE4/PEN6cW4LX+sxyVBT+N4yXLfzk4/7g2WF52jsQ5jSpT3qq+ABxD2q4O51TVzoa6vLypKfpBMFQqGoNC041Fo6nnmY/f9zKKD5zlPCHGwSz1kdVHU1wcY8kafJcek40hb9dgCD2r8UW9+516p5pOszbRxbG+q2v/Kf9VLZ5qq+0yvawmKCmNSX34seylCNRGsaZ83Kwtp9Esp1kZTqMxzllqo7O6wcZNp1nBa21aMf4AppNTixZpdIs0iuE0qvUz+z3Mh+sFs3W+1Xqa2souWOPjta9kvdTyx75b9zR1aQEJ1WFh6bBAc0gSDRb+AAvzAgtLgWQrwEJfTWMEryBBIiRbERbGDJJsBclSgsSXIDFnsAjWsNgpv4O1Fno76LsChfni573dqycW8RC6egcJWEMSj7BgZyVrSBIdEmsNiSZAoo2QBDostAssgtW0blprDrAINFigGSRMXzRe15jn1U/wnPosHY++m1CYK2TqY12QRd/1iS/8XtMq9KwsWilO6CZH37OEuETdiy9Y39XE64zGpcBi4DtfuCo6Q88ftxqeJWt8DNa4eNmLY1GvAuf3OKYgRzcOWMT5Vgc0rgIa54qSeFYduHP+eqegp+gntr7ithJtLBqXc7ZHDGzlxVe/wx3NgmhsSCQK50gCNM7nb/05nA+WNndgBXiG42MJTpGnnJg/H8vF6Fe4idbmMZJ21eNK0RxqyL6XjD9b93I3eo3xt33uGK61ATiBF3pWjShQLHdO4oqev8dByeAUa/XcYHchMtUxMvU21x6O1QhWBy9f+kiWd1m/wOr01Pc4U0/5Bh9fNGS43soB0WQwLmUgIjlwlnLganJQIhmst7LhFLJBCjlQNdl3kByovuyXmmyoBzlYIxk65tv+fo0pJAfG3wGWuwyWAYFEKSE5zCFZsrgsICnO1zW4hOWugMSfwRJnsEQDJGx9/M19UGE1aM5qx3TXY/0hq1vMJpX1SlMvM9Vv1ieCa+8wD1i9UOshYP0omfqbN/ZD15ADYsrAMWR/NGXfOUxYGKUvBy6SjZHZiWRfRDJk744mQxXJhhrL/hhPYwFZvrVfXfKQZAUsDR6WeglLk4dEE2FpziDZjpAoBSwRD0v/Asl2BkksQnIYIdF4SHxx2kfMyzc1ZM56z0Cd7r2sfxin+68zvbO+k9V0Aqaa3WTX+l2L7G7sk/ocsLvG2OTwm37GcJAMiC9Dx5ABw2GykdnF/G7KYNzKvshs3srAiWWgMq4cZN/xZX/Cjdnvf+N/ncBSzyHx51MOI8Uckl0JS3SGpXaGxOch2TJbR0gOAiy1ARJ0gcQqIVnOpvlSE771P1Cb3Lj2qZepV2bvhNX+CQfJuP4tgDdeYoD1eAyviRfq1FeyvuYt/51YNsalbDD7RCQbrikbjNtrdmeOZZ/4clBqEw4GixXVnPgORsabQgYl48j2G/8fREgSAomew9KikMQ8JDqFpTFCYpwhATksffFaB+IBku0ACePMVoBEIZBQOu196392j2FxTIxx6oeEiQ/OFPMzMDbFy31UmO6nLAaY3WOTT/39NMZ69rf2sxgPSl8Ga1MOVFMGqjHZZrA4KJHsk61slGxcm3zP8kWgLid+AGcrB86P4h9kkMTzK6eX5y9/bDILvLHR7GDy2MYaXdsIKFhD09yj2QAbUS11G9Xk9cEWEyXh6cp0kx3GdBchQdkLh9FwlM8+jy6GGqjAtQpD0njMJ7nrJRrCdG+Li9B2M9Hn5wpC2FgVO8v0knVYYOyg3c7itQtGWEmkxPAJgKFredEGhOaIRV8USMJntc/PQVhgycGWniIBmR6FWCt4LE4/HMiWF+/ZXMK/nmuUCAkO8pJdIHyjh9uvrDJzX/9Q4NJsn1J9a5eX0BKzOtAMITwwPitSICZ6iATF0BIVSfoG8TQ3eMuy0E5BGCumY+3MwpJML6kCHj+a7mJnFrplqdvR5/VzrGPHxbh1na3o89RaFYLgk11rCg18FOc6XGsS9moppE2WVsvBLUEeSaAwtOaS8Lva95pTyDcSGvWjzwunBG+lQF22MW5MqGE+1HEZCcXep7sgQj2Ih/4zEnerxAUnQC3bLbYzY0zmBla2htaJQMR9gkze2Ohyqi08Y8w+W8LuAogFIheLwF402OVH7GEQmI3s87r+OOq1o1EHl3hlCMXMWCefw7wbLRz4sRYcY5yFQTFrzUo5u86uBY7JA3cmxRWARtEN9ro/OSr+7Hi6mZb6eVVmWsRjNxICzy2ssykoq7QMTom7nSEh401xgS0072y9yQN0aQMX7EN+odoemNkbnzc2Ox24+i6W0BgisAcq4qMq3gOd5inyT+FG751NUzkIzC3tMNpav0t0WhnrXZ7wNMBrAQZ8Uj1KFgQjUNwqwXhNrYDXL7aDy0AEBLkCxYLOJ+dmMDxtNN0EmIWuWGJTBSSTAjGQEt5Sph+fiIJMrG8f+Z1ie4liaXphlgnERWYBDa8DQcdu0fGuveBBdThHBJxWNONjBwPAa5e9yJ+SckHgJsEIUw3T7TksdnokJY6NdBxVphSvg9LRt0OIkwGuLzzmmzFEl5VRWrvHMbmEWnJBuNg7aBekWqCZGKwCfu6ahQ4cZAzQa4KIBme/SKzE3Y52Oa9CXTv5w6J4FIMW6oFukKDejwCmRBENcfFkFYva0CzFOTeTLFvXZmahl1DDKxMJqlnqSsJj6QWDzix0KeFB5SL6mAh0ZVId25ouWV7ifrELFTsdbBJkI4pXtBigZxFrpLJLsx3TyylpgcXL6BaGkJSgDxDYRMXs7OKkiLRL71RB7mo70R93boou/fd2zfaBmNXh2hwdDwcGobzPx/OUNr7t4R/+CPntD4Mm1nVH21kmslhMr0zUV4bZtAlPSVoFul2ZA3IxwZop2aK+NTyLpOg8c7VtC7TFsBfALJSWZx9nXuImnwP38gQKiuNqO7NUqzWFLDR56oNRP61IINgVIImWEEu3Roj6AWtzP+T7c7qhl0DFKnRpEW/qM3YyJxoz51HCAOHsKSqzjVVsZ4GLZiYGMNW6E0YBH4j13lpjlGr91kfW2hJ3OsKNDDF4TEZzCMVmiJCQY0lv7LLxkqFHCdq5kdsNqMRr4AHsS+BiCv7ZUa1zTHcu9PR5fGgyXCxCZ9WrgdCoqGxqHzU23iR1KCkFkpoLKi0rlpaS74KZU+jbKO95vO4VZ0MvvpQoEbEKW4z5qLLEeENNGwO8Ko1TtMEgEuqZNRaCoWWj4yVPjwJFvkh3Fmqs1MUbYwzqZLRW/rDoEX8YrKJxUQlcawM8XARZQOITXlu2tQazMO/2sVhcTKqPKdV7A126SBPOwE0k0+H3Lz+S605h/k4NrD9++6OLbT9+2mu+/WlpgY9hW30Iz92HLo3btO/KsAoPafvh2N2mYdffCh8WkvQwF4XFw2KxeFn1Ia/6tK1C+imuy6bu0nb6vOe2q0/trHg5zkaKvbK2T84Wgk/GEizXL18GLIH6f35yd4y6uM2bPq+r25ctt3FdlmGV3BamT+vFl/N929GMTxtoO2BpaB+7Pjzk1eH2i+63X3S/C8/d3deXuouOOU3u6vbwLW7q1vp4n/bx/cuarxK+nKitLM2xvxqrAfUJboHzCVmPH7O+b7oP9/enJk5v+USQhPlM4uX5bBEJcXK7GC/twzg/3b1F4+4rGnds411YhmNdvSh8//objx/p9d3AXV+X9Meffvx7UZP8P15eQkrrc5p8SuoyzKuO+8j9O/euT8PyNTzv/oV7lx2ju6hNz9+On+u2SNvvp7gvJ8Qh95F792Ot4/A2bvu7Ji3f3XzR7irwH9bv/5kev/9l3j/yjd3ltstSSq8M/r2P7P7pPsqr+yjsspsu7bnb9FhzTd6kz2FOb7r62Mbpjz/pufkzZ6c912cp1w1dn5ZcVnd9FZbp3c2X/4t7ynVpf/vlnfvlmzj5n2KplR7yrk/bydy86vqwilPunPcZZ23A3c39sWvvaR2HdDokPHfc29DiDml/ex26PYX0mHL/i8XTl6E84X752x/lsN+4v3PkM3fbcu/u7Gmf3bd5dXjH/etV8dfp6tPLwZ9e0tUd6erq5sv2n618918Uxv2dm8BsS+72+b+qwP8Qf6tpQ+th8vZLoHKrJRenbZ8/53HYp3c3Udil8oy7Tbhb7q9//Sv3y9+++aTsN+5fuV/+9jqf//YqyL855Usa+KMz3nzL8MMTXgT90TlFOvxf0DatkqbOq/722FLG3J/Uot9+wPQfNgd/SO835f8tn19Pvfu91VfCfgX0J9gxcBh2r6j9g8P/u3D5RlPsT7YDreVa+3ifpKf76lSmQiXc2M7S0a6dxCls72kefd9NvOTxY8N1fd2Gh5Srq680ubvJn7l/4g5t2jA3fxH3G3fftHV8X9bHqu/+wphV3XDcnzmt6o5tymmKzeUd93ykdGDFv0rjPk2457zt+rsbjnuuW87ZGprF5RX3N/7uTuL53/7CJfVUJ/NnruvDnvvllV1fz2D/ojYNr43fc379+pumacMJNxyX1FV6M6myytK4YLI83Z6+W3+pUnnHhbRNw2TgyjBJmTqTjZfn7lNePde/d2xZPHd3l+fuzfzNpMJ0nhEWX5PFV3QnQ1Iuyds07ut2YEeVedfl1YEdXBZJ3nK3b7G9ilsmCdfX107ruevDiAurhJsAZzvTOKu5d7/87ZUuv731EFM1SZ/DI+07juf4d9zfuT5NudvwlVCmAxP51qhJAStlTLO1x7w6Xq4d3KXv2NltypiSxnXF3Von7gu1rtsYl16h3aTtZG9dTVvjrD6zXdynb5H68N3ID0DBaZs/s0QWvjQeL4zNO+7c5n0Y0fSG4/r6GGdvdt/fNW19ypkaeXX4FDNqMEOm8P7Dhc/5f5tQ/4OytUzIsev/M8n3NUdZ31KxmA65qq5uWeuShG3CNXXbX5HMO46mXcfRvEjpwDZF6c2fuS4OqypNJt41bR2lyd3NnzkHqvD/K7NwSNLq///AuSlXpWxRHDMRjBptHrP637EzmZOqtGeNMUfTU0q5sOe6umTypwLyL1x07LlzygL3n3suC08pl/dcmx+ynqvq893N1xiZWHulVfLy3++y2W3Y5HddHRdpf5fc3zC+/+Pb6lPatnmS3sV19cyKz5RSj5Ryf/0rp0H95t/tael/3DxO4Np9m4blx7dvi/cP8g1bfD2SdcJJmJZ1ddumtA4T5q6nNm3C9vus8c8MyLLuU+56o+C6tD3lcdpNvrjq2d29klyGXfFVynXPvwl3L7terUsrFiLc7W1Vn7+uvx71su0FhT/a8wPgvouR29s/3fzvAAAA//8GwsrorTQAAA==" -> "H4sIAAAAAAAA/9S6aZOcSJYu/D3N+j8w6jab97WazGSJIBXq1tgEAcSWuCeLO0vfMRlbBjjOIiAW6K7/fs2JlDpTUqmm770fZmSGVeHL8XOe85zFM1jVVZ9W/a0zNOkHrjzSPm/Ctr8v80ua/JmL6mOVhO3w8Z2xNTQFIqAuLf/dDXu7xWnb5XX1gRPu+D/c/OHm9vb1oj/cfJGt5l1Td3k/rQ37PoyzMq36P3PPOU2rsEw/vsurvL+Lnw/v/rHLacOqe07bW62K6ySvDh+4hyjvXy2YVO7TS38f0/qY3MZ19Zwf/nBj5GX6nXJ/fL3m5ubYpW334YbjbjmmwQcujcVbNnjDcRzXddmn8NhndZuPafKpSIdpLft3y73ruuy27UJuuVwuFQmM4UoYYlFjr+rSXCrL5XK1NFcX8qxvt3T9vKoWeUw3Q+m2mtI6SKSPcl/Ya0dIm4dk9TSeBeLLbpWZ9MkzmvSpzcEFeHT9Pnbh4t7SGyXhx4V+BsMvxfMhWzwfB+DPFttfjFCGg4OVwzwDtX55trz1PN/08b1t0irS9Hzf2MWM5k09M4Ne6cvD8vOhsJeyOmbDIZKPc2ORX5ztZeYq5Ggb/NozR0Ca9HnI3eMv3db6JRNRaxb7pXI8bn0zagn9Rc9wGT6e2tPgQPHYwf5U+QrJoqfzAB9E94mEzT65X2RO+PlJE876ICNdrLx49nQ484fcjOQuj3RnfABOenGlubl4/7kxoWv4+7g5BC21w81mH9hG1o/wwUiCFj7qyKttYZkuh9kh62PQQsWh0dw+PT1I48h/VixdjFdwBvlzMz+fPz9lp7NY9ZHUOI9PfZL2u1/wnDefqqbyBtuugkYc9XOcikLkXeSHKlvQKntsgwNJH+LarJ6W+uU+ppKs2bvhkB+fYuX8SyG894/UNzz0OVT64rx7LCyiNsTxxHRu7AS5Vh+63Sae3bvzYnh+PCVGh7Pks7DyNmuMYTPWh4hfzLGf85anN1Vg3QspPqzurV9cPPT+s/+eb58xjJNlLa6D52o3H30LebvdwgiKsLpcJO0BwbzQdmDRISLy/CivhoHfPm8/O9FOUObPD8+JFMZW+zhTYx8l+vZeUAbgyrpAHuIgX67hbg+i0dN5R+qf31/4VDA/fuTKkNTtf7RpkoX9XVyX797yPU3E+VxYTJxfXTlPA3UrAEebs7HtkyIQnc4aWXeU/LJx5DMsZO99Re6Dh7R+AqZ2b/Dn/ez9fM/V0TEJ8zeH3ZzbvE8/sYzwEpZN2GcfuPu+bK7h/YnliE+nsO0mzeJrFvjA/f1FUWgraPuoflpBw9g6H99Lcfj8nufTuTgXZ9FMmD0/PM+j53mY8okULwQxfr8QFuLL7hU0nqCtWV+2LyIxmcvz+Wz+MBcl6f3DTIikVAzT8Pn9gyQ/pKIUvheT2beHLz+tNMv5+Gjz/aMtrCyU7JxcUS28QzYKdiavI2ua4/tVIexsZGlYA6rpBl7A65KNdkrAU4xUYBqiPwKsrFExFyIx4NPSmDtqIVrrDEWipSS8ZbmoeYyEZhduAuIUumWh896kupLwwWcLY2AWdGM6OraQLiX8JTf4eRPoSRcLjQq8gEQukOx1RpxC+Gx6yRPWsOxgK0iRoGEHeOEaQMdrlOTcsLnZm7lC9xy8sxIeVy6yXIR1zdJ0PimNwSZ6hqWsddb8PMWNbPJAQTyVLF0P7KI/uQWtkxLA1aTzboWQrgVioiNN16a17kJl72ahA7NSWhfrvo2B4Y/Zo+s2AGFapZViQQQUQ9g9GmWytVTl4nv6mJDD3sc7ggtDBNSYB0V2sRC6hOiCXe29ZKg7KyV4DMWmNqTm4mzoBpFMQtQ/PYpgZ7jbS0wUnOLG8flLaAixhHEzmOeaB6pV+lI9Oh6dRTqQsYADJCiVWdDHcJ0ocKP3MW1sw12UvmsN6QbbzqofoyLQbLefGVLc+qO+DzA+GiXoDD1pVhTzrrrbWEKgWjQBjqifgsJqXR2rVoUf7U2yR26ydjbWaGsgdF1QJjRxbb0JQTGbJXxyNqgeus527o+ZEHnKZwMv90gLOlczZsFaDx1NyFyd5pajANuzXEMDW7tSJIunZ7+ixwhTFK360aqwGKnWCa+FId3Up9TL5FizRFwIT3Gh7yKzmUViJ8UU93iDC2uNdSTsVo6YKAbqBR8JNt7gzPYUKxp3RSQFl/24vFilP5poNmAElITHiunqEGvC2vKSLcJUW9HANrTFyqRUt4paCpzAN6TiHKwXXWwv9j4NGr+gTSJaRyQsW1AIK6glioFxYXuJ5SJh5SN9bZOEAnoYU0cpIvG8/429ype9lpfoZr6QEAqAiYSV6fqzH8fV5StHzUOjWFUjApFSm4/nkd48xsV2cFwhDDX9YmvUSN1L5kjUjZ1Yska6cvAOWRU4uxXijc1WsgRL8nmrTsqDYCFwsnU9X5WXNnEUH6CFH/CW6G7AKl4v1vZmJxpa/2S7FwcIeG94/hmsu5NNaeVu4jZaNwhvjBP0mnNEMhuXlz7eoJPFC0+Og/bI3W3QqochwWE84tLiAy/UZpLjbAXk9hiqu320yahd6B3ysq0pXlS0xjNUAOA7+hx4Swmv5xVUlUebJnyKFROaDY/EBJjVUgIY24H7ngcIzZDWDHa1HMMNPQF9N4N4Z1liP6QusG0vKc0iE0MpA3YZHGPRkFx7IQKXChbJ+lQT5BUBvF/U8z3fzC2kC/amvvhFIsQI+HtJ3yNsoWS1sKLRH5Ii8XxUzJEQPPrUmPk4M8xxB0Glk9DdXWKCZgGxNLsw93YFOsd+L8UbMI+JfgKexfvF7ghoIZiesVjl15xsobm21YCOqLWzCqqa2NKvuZzff1cpWKI3RTwka1qGLsiSNZJX+fKwXSma71kZPNSH7Wp5ffSAxhVoInEmb1XjsFeVmZEX+6/zK8UJvF3ju+eDU+HeL/HwZv/1EQ21nkGnnvljfTbGhgKnKcHYFGCseag2hT/WF2OshUCtR9+pzz6p52B6b4rAabLAqS+A1BfoNDl4ox9oAnGeJRs8BLaiROvkFJeUD9e8vN2A2ne2AqBJk6wzG/G6HpVgSD2FD93F8Wrz9bE9MCYuHmCuqA4RTrG4E0L3UjyWiyE4v8Eji9a0CD1r/nr/9GjzU7JSVoEbnOISyVutyaJ8eTHYo9YDcOoBrpaDoW4vWy0BePktTgqMJPNgugEfeNsDzJW9784OhrNkj2wQJBvkcDDIcjRsZeNg840fEnf3OXABD3OFRq7eRJpeBJsdjSVjEUkgT1zaBWs8xLwyBK5V+5559MVF/9oOJOE8LDFJVoqZuLsudI2DLeL5VqPHoHwvf2ezrgh+eWn8QXkMvOJgupcqknYM7x7myhCLv435K91txGsHtMF5tKbkEfU0derDXt2egXo4+CXl9+Z3nJoex10UiXsR4rHe/2j+5TkbalMC0hSB2hDmC+g0GXBYYaznUK0Fg9Q8IDW7RFDoNMQgNfPZaJCfyVUoIExuPZ/8S2o+UJsycGrJcOrRH2vRJ00OnHpknA8cJr8WfKchgfNTfecB02uS0+S+Uw/+WEssVgxSi2y/odYXpveLLBZb50nvn8sdArUWwVhLhtoQJjdgGIxNzsaA2pQ+w4XZQZrSUGveJ7VoOLXwc7lK6TuTPmKgTnHKsBggO4PUI9MvmPBh+jU509N3pjjnA/Wn+jJZvOE0pTGy4tqUBmkKpicbA2o9+ITlBpYj6rnvNJT5meWT3/Fb5o9MRj1Ch+nclP445SYRqBO+1Cf1zBgnOyTfufo0IBPOP9OXn/LTyPjUUGOsLwHzz5VzZ6Z3QGoBXnEdDGfKCULg1Gfwc/5KjJv+ONl1hiqT3ZQ+mXh2eZExNxzm2yZjvGE8CxiffypXoYZaiy+xMAvUJgNqQ8FYz4IrNvOAMP411B8nWaLB+EyYXT/H4ZrDG8r0ZjgyfwfX+GL6zcBLngdqLQBSz5gNgEz4/0zuxBljwqK+MDwC0mTGdM7kQ57Z7jPOsHG21qnPLJZ+R+6EF8MTqoyfk32ScY3BM/MPVOsZ47IxzU18GIHaZP7P/cYHDovRejAIi4WJGzOosvfprAlryHjNfMpwYXFH6svv+K2EE09Z7mpyf2S8r0eWgxiPJ95N3LjG+BQzjG8sLn4exzm4xv0w6aJe/QdIfTacJjOm3NYULBZ9MtXsM4sPQ/29/LAcoTrlyBmLA5/lK/XaA0CV+XHi8Xnim1ML8Fr/WY7Kgp/G8ZLlvxycf1wbLC87R+KcRpUpb1VfAI4hbVeHc6pqZ0NdXt7UFP0gGCoVjUGh6cai0dTzzMfvexnFB85ynhDjYJb6yOqjKS6OsWQNvkuPycaQt2swhJ7V+KLe/Ua9U02nWZvo4ljf1bV/yH9Vi6faartML6sJSkpjUh9+LHspArVRrCkfN2vLaTTLaVaG02iMc5ba6KxusHHTaVbwWptWjD+A6eTUokUa3SKNYjiNav3Mfg/z4XrBbJ1vtZ6mtrIL1vh47StZL7X8se/WPU1dWkBCdVhYOizQHJJEg4U/wMK8wMJSINkKsNBX0xjBK0iQCMlWhIUxgyRbQbKUIPElSMwZLII1LHbKb2Cthd4O+q5AYb74eW/36olFPISu3kEC1pDEIyzYWckakkSHxFpDogmQaCMkgQ4L7QKLYDWtm9aaAywCDRZoBgnTF43XNeZ59RM8pz5Lx6PvJhTmCpn6WBdk0Xd94gu/17QKPSuLVooTusnR9ywhLlH34gvWdzXxOqNxKbAY+M4XrorO0PPHrYZnyRofgzUuXvbiWNSrwPktjinI0Y0DFnG+1QGNq4DGuaIknlUH7py/3inoKfqJra+4rUQbi8blnO0RA1t58dVvcEezIBobEonCOZIAjfP5W38O54OlzR1YAZ7h+FiCU+QpJ+bPx3Ix+hVuorV5jKRd9bhSNIcasu8l48/WvdyNXmP8bZ87hmttAE7ghZ5VIwoUy52TuKLn73FQMjjFWj032F2ITHWMTL3NtYdjNYLVwcuXPpLlXdYvsDo99T3O1FO+wccXDRmut3JANBmMSxmISA6cpRy4mhyUSAbrrWw4hWyQQg5UTfYdJAeqL/ulJhvqQQ7WSIaO+ba/X2MKyYHxd4DlLoNlQCBRSkgOc0iWLC4LSIrzdQ0uYbkrIPFnsMQZLNEACVsff3MfVFgNmrPaMd31WH/I6hazSWW90tTLTPWb9Yng2jvMA1Yv1HoIWD9Kpv7mjf3QNeSAmDJwDNkfTdl3DhMWRunLgYtkY2R2ItkXkQzZu6PJUEWyocayP8bTWECWb+1XlzwkWQFLg4elXsLS5CHRRFiaM0i2IyRKAUvEw9K/QLKdQRKLkBxGSDQeEl+c9hHz8k0NmbPeM1Cney/rH8bp/utM76zvZDWdgKlmN9m1ftciuxv7pD4H7K4xNjn8pp8xHCQD4svQMWTAcJhsZHYxv5syGLeyLzKbtzJwYhmojCsH2Xd82Z9wY/b73/hfJ7DUc0j8+ZTDSDGHZFfCEp1hqZ0h8XlItszWEZKDAEttgARdILFKSJazab7UhG/9D9QmN6596mXqldk7YbV/wkEyrn8L4I2XGGA9HsNr4oU69ZWsr3nLfyeWjXEpG8w+EcmGa8oG4/aa3Zlj2Se+HJTahIPBYkU1J76DkfGmkEHJOLL9xv8HEZKEQKLnsLQoJDEPiU5haYyQGGdIQA5LX7zWgXiAZDtAwjizFSBRCCSUTnvf+p/dY1gcE2Oc+iFh4oMzxfwMjE3xch8VpvspiwFm99jkU38/jbGe/a39LMaD0pfB2pQD1ZSBaky2GSwOSiT7ZCsbJRvXJt+zfBGoy4kfwNnKgfOj+AcZJPH8yunl+csfm8wCb2w0O5g8trFG1zYCCtbQNPdoNsBGVEvdRjV5fbDFREl4ujLdZIcx3UVIUPbCYTQc5bPPo4uhBipwrcKQNB7zSe56iYYw3dviIrTdTPT5uYIQNlbFzjK9ZB0WGDtot7N47YIRVhIpMXwCYOhaXrQBoTli0RcFkvBZ7fNzEBZYcrClp0hApkch1goei9MPB7LlxXs2l/Cv5xolQoKDvGQXCN/o4fYrq8zc1z8UuDTbp1Tf2uUltMSsDjRDCA+Mz4oUiIkeIkExtERFkr5BPM0N3rIstFMQxorpWDuzsCTTS6qAx4+mu9iZhW5Z6nb0ef0c69hxMW5dZyv6PLVWhSD4ZNeaQgMfxbkO15qEvVoKaZOl1XJwS5BHEigMrbkk/K72veYU8o2ERv3o88IpwVspUJdtjBsTapgPdVxGQrH36S6IUA/iof+MxN0qccEJUMt2i+3MGJO5gZWtoXUiEHGfIJM3NrqcagvPGLPPlrC7AGKByMUisBcNdvkRexgEZiP7vK4/jnrtaNTBJV4ZQjEz1snnMO9GCwd+rAXHGGdhUMxas1LOrrNrgWPywJ1JcQWgUXSDve5Pjoo/O55upqV+XpWZFvHYjYTAcwvrbArKKi2DU+JuZ0jIeFNcYAvNO1tv8gBd2sAF+5BfqLYHZvbG543NTgeuvoslNIYI7IGK+KiK90CneYr8U7jRe2fTVA4Cc0s7jLbW7xKdVsZ6lyc8DfBagAGfVI+SBcEIFLdKMF5TK+D1i+3gMhABQa5AsaDzybkZDE8bTTcBZqErlthUAcmkQAykhLeU6ccnoiAT69tHfqfYXqJYml6YZQJxkVlAw+tA0LFbdLxrL3hQHc4RAacVzfjYwQDw2mUv8qekXBC4STDCVMN0ew6LnR5JiWMjHUeVKcXroHT07RDiZIDrC4/5ZgzRZWWU1u5xTC6hllwQLvYO2gWpFmgmBquAn7tmoQMHGQP0miCiwdkvEitxt6NdzqtQ107+sCgexaCFeqAbJKj3I4ApUURDXDxZxaI2NEtxzs0ky9a1mVnoJdTwykSCapa6kvBYesGgMwtdSnhQuYg+JgJdmVTHtqZLlpe4X+xCxU4HmwTZiOIVLQboWcQaqezSbMf0ckpaYPEyuoUhJCXoAwQ2UTE7uzgpIu3SO1WQu9pO9Medm6JL/71ds30gZnW4NkfHw4FBKO/z8TyljW97+Ic/Qn77w6CJdd3RdpaJLBbTKxP1lWE2bcJTklaBblfmgFxMsGZKtqhvDc8iKTrPXG3bAm0x7AUwC6Xl2ceZl7jJ58C9PIGC4rjazizVak0hC02e+mDUTysSCHYFSKIlxNKtEaJ+wNrcD/n+nG7oJVCxCl1axJv6jJ3MicbMeZQwQDh7ispsYxXbWeCimYkBTLXuhFHAB2K9t9YYpVq/9ZG1tsSdjnAjQwwek9EcQrEZIiTkWNIbu2y8ZOhRgnZu5HYDKvEaeAD7EriYgn92VOsc050LPX0eH5oMF4vQWfVqIDQqKpvaR42NN0kdSkqBpOaCSsuKpaXku2DmFPo2ynser3vF2dCLLyVKRKzCFmM+qiwx3lDTxgCvSuMUbTCIhHpmjYVgaNnoeMnTo0CRL9KdhRordfHGGIM6Ga2VPyx6xB8Gq2hcVALX2gAPF0EWkPiE15ZtrcEszLt9LBYXk+pjSvXeQJcu0oQzcBPJdPj9y4/kulOYv1ED64/f/uhi24+f9ppvf1pa4GPYVh/Cc/ehS+M27bsyrMJD2n44drdp2PW3woeFJD3MRWHxsFgsXlZ9yKs+bauQforrsqm7tJ0+77nt6lM7K16Os5Fir6ztk7OF4JOxBMv1y5cBS6D+n5/cHaMubvOmz+vq9mXLbVyXZVglt4Xp03rx5XzfdjTj0wbaDlga2seuDw95dbj9ovvtF93vwnN39/Wl7qJjTpO7uj18i5u6tT7ep318/7Lmq4QvJ2orS3Psr8ZqQH2CW+B8Qtbjx6zvm+7D/f2pidNbPhEkYT6TeHk+W0RCnNwuxkv7MM5Pd2/RuPuKxh3beBeW4VhXLwrfv/7G40d6fTdw19cl/fGnH38tapL/58tLSGl9TpNPSV2GedVxH7m/cu/6NCxfw/Pu37h32TG6i9r0/O34uW6LtP1+ivtyQhxyH7l3P9Y6Dm/jtr9r0vLdzRftrgL/af3+n+nx21/m/TPf2F1uuyyl9Mrg3/rI7l/uo7y6j8Iuu+nSnrtNjzXX5E36HOb0pquPbZz++JOemzTOau6dnfZ9Xh24buj6tOSyuuursEzv3t3c/JGz057rs/S7yZsv/xf3lOvS/vbLO/enbwLpfxQU12wRMTjyquvDKk65vuasDbjCYaWHvOvTdsLk64pz3mfTmpv7Y9fe0zoO6aRJeO64twHKHdL+9jp0ewrpMeX+F4vKL0N5wv3pb7+XCX/l/s6Rz9xty727s6d9dt/m1eEd9+9X614nvU8vB396SXp3pKurmy/bf7by3X9RGPd3bkK8Lbnb5/+qAjc/SswvH6pyt7fhsa//JxFHTRtaD4w2rLBxYZVwcdr2+XMeh33aXclzXTRR5yV3cKvl63V3N1HYpfKMu024W+4vf/kL96e/ffOV26/cv3N/+tvrEvPrq7zzzSlfMtPvnfHm84ofnvAi6PfOKdLh/yIG0ipp6rzqb48tZWHwk/L46w/C5of9yu/GypuO5G1wvJ5691urr+z/CuhPsGPgMOxexckPDv/vQvobTbE/2Q60lmvt432Snu6rU5kKlXBjO0tHuzY3p7C9p3n0fYPzTWk5Nv/gSNfXbXh4VV6OzZcxrq6+rru7yZ+5f+EObdowLnw581fuvmnr+L6sj1Xf/ZnRr7rhuD9yWtUd25TTFJvLO+75SOnAmpYqjfs04Z7ztuvvbjjuuW45Z2toFpdX3N/4uzuJ53/9M5fUU33Pn7muD3vuT6+M/3oG+xe1aXhtWJ/z61frNE0bTrjhuKSu0ptJlVWWxgWT5en29L39S/HMOy6kbRomA1eGScrUmWy8PHef8uq5/q1jy+K5u7s8d2/mbyYVpvOMsPiaUW5f4Rz2KZfkbRr3dTuwo8q86/LqwA4uiyRvudu32F7FLZOE1bypx3nu+jCa0tkEONt59eyf/vZKl1/feoipmqTP4ZH2Hcdz/Dvu71yfptxt+Eoo04GJfGvUpICVMjra2mNeHS/XzvPSd+zsNmVMSeO64m6tE/eFf9dtjEuv0G7SdrK3rqatcVaf2S7u07dIffhu5Aeg4LTNn1m2C1/6oRfG5h13bvM+jGh6w3F9fYyzN7vv75q2PuVMjbw6fIoZNZghUw743YXP+X+bfPBPNJJvoj1tT3n8pQIuE3Ls+n/M9jVHWT9VscgPuaqubllLlYRtwjV121/xzjuOpl3H0bxI6cA2RenNH7kuDqsqTSZ2Nm0dpcndzR85B6rw/yuzcEjS6v//wLkpV6VsURwzEYxAbR6zpqNjZzJXVmnP2n6OpqeUcmHPdXXJ5E+16N+46Nhz55SF97/2XBaeUi7vuTY/ZD1X1ee7m6+RNHH7Sr7k5b/fJcbbsMnvujou0v4uub9hUfHPb6tPadvmSXoX19Uzq2NTdj5Syv3lL5wG9Zu/2tPS/7x5nMC1+zYNy49v3xbvH+Qbtvh6JGvjkzAt6+q2TWkdJsxdT23ahO33ueVfGZBl3afc9b701cuTL656dnevJJdhV3yVct3zH8Ldy65X69KKBRJ3e1vV56/rr0e9bHtB4ff2/AC47yLp9vYPN/87AAD//3gWRYyLNQAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0748f8ec6961af29b" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 7 -> (known after apply)
        id                      = "lt-04e6df10bd74694e7"
      ~ latest_version          = 7 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTcyLjMxLjY0LjExCk9TQlVJTERfQ0FfQ0VSVD1MUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VSRVZFTkRRV1pYWjBGM1NVSkJaMGxWVUROUU0yWXpOVkJHVWs1MWIyWjBlbU01VERrMlJHaFViMlJCZDBSUldVcExiMXBKYUhaalRrRlJSVXdLUWxGQmQwWnFSVlZOUWtsSFFURlZSVUYzZDB4aU0wNXBaRmRzYzFwRE5YWmpiV04zU0doalRrMXFRWGRQVkVWNlRWUlplVTFFVlROWGFHTk9UWHBCZHdwUFZFVjRUVlJaZVUxRVZUTlhha0ZYVFZKUmQwVm5XVVJXVVZGRVJFRjBkbU15U2pGaFYzaHJURzA1ZVZwNlEwTkJVMGwzUkZGWlNrdHZXa2xvZG1OT0NrRlJSVUpDVVVGRVoyZEZVRUZFUTBOQlVXOURaMmRGUWtGTlFuQnJXVkZZU1ZOTVl6aExXV3BOVVZsbmVuQlJPVU5CTTFKTE1tZElSREJ4WVhGemRqZ0tZVkpqVmtNMk5sTTVaa2h4UlVVeGFVeFZXRTgzTURKUmVqVnphMnBvTTNweFRIbEhVamgzVWxZdkwyTkpNV0l4Y2pCVmVWcFRZMHhhTTFjM1ZWcHlRd28wTkRSbVkzb3pUWGw0YkZONlYxVlpVMUJuUWtsTGFHZEJPSEZ0Y2xwU01XOW1ZV1J5ZUhWU1RDdHpia1pFU1d0NE0zY3JZekZLWlZWdU1tTnNNRmRwQ2xWMFdESkhSMVpEUmxkTlQyRnZaa1JyV0ZWRFJuVkxTSGRLVVdkR1RIUnpTRU5hV1dObWRsZFdTRnBhTms0NGQwZHdNbEZhV1RJNVl6aDFiWEJxTVZBS1VFWnNXRU00WkdGYVRFMWhXRmxpUlRCTlNYUldNRU5JU25CM1IwbHdZbmx1YlZsVWJDdHpSblYyYkRSdlZHMXllSG92ZVhoNmNFUjJWazFQY2tGSmJRcDRiMnMzY2xWdFZIVmtSR1ZGVTFKQ1QyZEJNVXQxWVUxU1ZIVmhTWEJSYnpKa2IzWnhLekF4Um1ZelFVNHlWVU5CZDBWQlFXRk9WRTFHUlhkSVVWbEVDbFpTTUU5Q1FsbEZSa28zWlRaWU0za3daRzlzY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFDT0VkQk1WVmtTWGRSV1UxQ1lVRkdTamRsTmxnemVUQmtiMndLY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFCT0VkQk1WVmtSWGRGUWk5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWdwQlJucDJOMmxsUzBjNWJGcExja0l5VFcxYWFFRnhTRWxNZVd4aFQzbFdjVGMzUnpsQ1RWSlVSbk53V25VME1ISTNSMVIzWTBSb2RtZzFSVU52U0ZGaUNteHJkVEJZTlU5WVowUjJXSE5DY0c5R1NISjJNRXRQU1d4VE4xVktNWFl3TkdzdlNsbG5XSGNyYkdwVVZITXZPWHB3YmpoU1ZteHRjSFV2UjAxUFRUVUtVV0pIVUN0T2FqVmFjelZtUjBaWGFFNDNUVEkxVVd0Vk9ESktiSGhsU2tGc1VYaElRMnhEVUdWNFVrTk5ZVEY1TlhBM1ZHNW5PREJMU2xkMGVWQlFPUXAwVTJkTlFuQTNOVlZTWlc4ME5VVTRVRXB5U25BemFIbHZORko0T1ZKUlIydHllV05TU1hkbVFraDJhM2hOU21adWMyTTNXUzkyTldsMVJqaHRlRTE2Q2pOMFlrbzVLMHA1UlVGMVNIb3hZa2QxY1VOWUszRktVVlJVZEM5UmJ6WXlka2RYWVVrNVUxWkxZbE00WVZoTVF6Sk9ObkZqYVdKeGNqVTRaalJFU2tRS1NuTnNUUzgzY0hONWNqRnZOWFIwWWtKdU5sazFRWE05Q2kwdExTMHRSVTVFSUVORlVsUkpSa2xEUVZSRkxTMHRMUzBLCldPUktFUl9TU0xfS0VZU19BUk49YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy1lYXN0LTE6OTMzNzUyMTk3OTk5OnNlY3JldDpicmV3X2tleXMtN0ZVZWVsCgojIFZhcmlhYmxlcyBmb3IgdGhlIHNjcmlwdC4KQ09NUE9TRVJfRElSPS9ldGMvb3NidWlsZC1jb21wb3NlcgoKIyBBZGQgbWhheWRlbidzIFNTSCBrZXkgdGVtcG9yYXJpbHkuCmN1cmwgaHR0cHM6Ly9naXRodWIuY29tL21ham9yLmtleXMgPj4gL2hvbWUvZWMyLXVzZXIvLnNzaC9hdXRob3JpemVkX2tleXMKCiMgU2V0IHVwIC9ldGMvaG9zdHMKIyBUT0RPKG1oYXlkZW4pOiBXZSBuZWVkIHRvIGNvbnZlcnQgdGhpcyB0byBETlMgbGF0ZXIgd2hlbiB3ZSBsYXVuY2guCmNhdCA8PDwgIiR7Q09NUE9TRVJfQUREUkVTU30gJHtDT01QT1NFUl9IT1NUfSIgPj4gL2V0Yy9ob3N0cwoKIyBEZXBsb3kgdGhlIGNvbXBvc2VyIENBIGNlcnRpZmljYXRlLgpta2RpciAke0NPTVBPU0VSX0RJUn0KYmFzZTY0IC1kIC0gPDw8ICR7T1NCVUlMRF9DQV9DRVJUfSA+ICR7Q09NUE9TRVJfRElSfS9jYS1jcnQucGVtCgojIERlcGxveSB0aGUgY29tcG9zZXIga2V5IGFuZCBjZXJ0aWZpY2F0ZS4KL3Vzci9sb2NhbC9iaW4vYXdzIHNlY3JldHNtYW5hZ2VyIGdldC1zZWNyZXQtdmFsdWUgXAogIC0tc2VjcmV0LWlkICR7V09SS0VSX1NTTF9LRVlTX0FSTn0gfCBqcSAtciAiLlNlY3JldFN0cmluZyIgPiAvdG1wL3dvcmtlcl9rZXlzLmpzb24KanEgLXIgIi53b3JrZXJfa2V5IiAvdG1wL3dvcmtlcl9rZXlzLmpzb24gfCBiYXNlNjQgLWQgLSA+ICR7Q09NUE9TRVJfRElSfS93b3JrZXIta2V5LnBlbQpqcSAtciAiLndvcmtlcl9jcnQiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1jcnQucGVtCnJtIC1mIC90bXAvd29ya2VyX2tleXMuanNvbgoKIyBQcmVwYXJlIG9zYnVpbGQtY29tcG9zZXIncyByZW1vdGUgd29ya2VyIHNlcnZpY2VzIGFuZCBzb2NrZXRzLgpzeXN0ZW1jdGwgZW5hYmxlIC0tbm93IG9zYnVpbGQtcmVtb3RlLXdvcmtlckAke0NPTVBPU0VSX0hPU1R9Ojg3MDAKCg==" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 8 -> (known after apply)
        id                      = "lt-0aae9d85fdd3f7067"
      ~ latest_version          = 8 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTAuMzAuMTguMTEKT1NCVUlMRF9DQV9DRVJUPUxTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVVJFVkVORFFXWlhaMEYzU1VKQlowbFZVRE5RTTJZek5WQkdVazUxYjJaMGVtTTVURGsyUkdoVWIyUkJkMFJSV1VwTGIxcEphSFpqVGtGUlJVd0tRbEZCZDBacVJWVk5Ra2xIUVRGVlJVRjNkMHhpTTA1cFpGZHNjMXBETlhaamJXTjNTR2hqVGsxcVFYZFBWRVY2VFZSWmVVMUVWVE5YYUdOT1RYcEJkd3BQVkVWNFRWUlplVTFFVlROWGFrRlhUVkpSZDBWbldVUldVVkZFUkVGMGRtTXlTakZoVjNoclRHMDVlVnA2UTBOQlUwbDNSRkZaU2t0dldrbG9kbU5PQ2tGUlJVSkNVVUZFWjJkRlVFRkVRME5CVVc5RFoyZEZRa0ZOUW5CcldWRllTVk5NWXpoTFdXcE5VVmxuZW5CUk9VTkJNMUpMTW1kSVJEQnhZWEZ6ZGpnS1lWSmpWa00yTmxNNVpraHhSVVV4YVV4VldFODNNREpSZWpWemEycG9NM3B4VEhsSFVqaDNVbFl2TDJOSk1XSXhjakJWZVZwVFkweGFNMWMzVlZweVF3bzBORFJtWTNvelRYbDRiRk42VjFWWlUxQm5Ra2xMYUdkQk9IRnRjbHBTTVc5bVlXUnllSFZTVEN0emJrWkVTV3Q0TTNjcll6RktaVlZ1TW1Oc01GZHBDbFYwV0RKSFIxWkRSbGROVDJGdlprUnJXRlZEUm5WTFNIZEtVV2RHVEhSelNFTmFXV05tZGxkV1NGcGFOazQ0ZDBkd01sRmFXVEk1WXpoMWJYQnFNVkFLVUVac1dFTTRaR0ZhVEUxaFdGbGlSVEJOU1hSV01FTklTbkIzUjBsd1lubHViVmxVYkN0elJuVjJiRFJ2VkcxeWVIb3ZlWGg2Y0VSMlZrMVBja0ZKYlFwNGIyczNjbFZ0VkhWa1JHVkZVMUpDVDJkQk1VdDFZVTFTVkhWaFNYQlJiekprYjNaeEt6QXhSbVl6UVU0eVZVTkJkMFZCUVdGT1ZFMUdSWGRJVVZsRUNsWlNNRTlDUWxsRlJrbzNaVFpZTTNrd1pHOXNjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUNPRWRCTVZWa1NYZFJXVTFDWVVGR1NqZGxObGd6ZVRCa2Iyd0tjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUJPRWRCTVZWa1JYZEZRaTkzVVVaTlFVMUNRV1k0ZDBSUldVcExiMXBKYUhaalRrRlJSVXhDVVVGRVoyZEZRZ3BCUm5wMk4ybGxTMGM1YkZwTGNrSXlUVzFhYUVGeFNFbE1lV3hoVDNsV2NUYzNSemxDVFZKVVJuTndXblUwTUhJM1IxUjNZMFJvZG1nMVJVTnZTRkZpQ214cmRUQllOVTlZWjBSMldITkNjRzlHU0hKMk1FdFBTV3hUTjFWS01YWXdOR3N2U2xsbldIY3JiR3BVVkhNdk9YcHdiamhTVm14dGNIVXZSMDFQVFRVS1VXSkhVQ3RPYWpWYWN6Vm1SMFpYYUU0M1RUSTFVV3RWT0RKS2JIaGxTa0ZzVVhoSVEyeERVR1Y0VWtOTllURjVOWEEzVkc1bk9EQkxTbGQwZVZCUU9RcDBVMmROUW5BM05WVlNaVzgwTlVVNFVFcHlTbkF6YUhsdk5GSjRPVkpSUjJ0eWVXTlNTWGRtUWtoMmEzaE5TbVp1YzJNM1dTOTJOV2wxUmpodGVFMTZDak4wWWtvNUswcDVSVUYxU0hveFlrZDFjVU5ZSzNGS1VWUlVkQzlSYnpZeWRrZFhZVWs1VTFaTFlsTTRZVmhNUXpKT05uRmphV0p4Y2pVNFpqUkVTa1FLU25Oc1RTODNjSE41Y2pGdk5YUjBZa0p1TmxrMVFYTTlDaTB0TFMwdFJVNUVJRU5GVWxSSlJrbERRVlJGTFMwdExTMEsKV09SS0VSX1NTTF9LRVlTX0FSTj1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLWVhc3QtMTo5MzM3NTIxOTc5OTk6c2VjcmV0OmJyZXdfa2V5cy03RlVlZWwKCiMgVmFyaWFibGVzIGZvciB0aGUgc2NyaXB0LgpDT01QT1NFUl9ESVI9L2V0Yy9vc2J1aWxkLWNvbXBvc2VyCgojIEFkZCBtaGF5ZGVuJ3MgU1NIIGtleSB0ZW1wb3JhcmlseS4KY3VybCBodHRwczovL2dpdGh1Yi5jb20vbWFqb3Iua2V5cyA+PiAvaG9tZS9lYzItdXNlci8uc3NoL2F1dGhvcml6ZWRfa2V5cwoKIyBTZXQgdXAgL2V0Yy9ob3N0cwojIFRPRE8obWhheWRlbik6IFdlIG5lZWQgdG8gY29udmVydCB0aGlzIHRvIEROUyBsYXRlciB3aGVuIHdlIGxhdW5jaC4KY2F0IDw8PCAiJHtDT01QT1NFUl9BRERSRVNTfSAke0NPTVBPU0VSX0hPU1R9IiA+PiAvZXRjL2hvc3RzCgojIERlcGxveSB0aGUgY29tcG9zZXIgQ0EgY2VydGlmaWNhdGUuCm1rZGlyICR7Q09NUE9TRVJfRElSfQpiYXNlNjQgLWQgLSA8PDwgJHtPU0JVSUxEX0NBX0NFUlR9ID4gJHtDT01QT1NFUl9ESVJ9L2NhLWNydC5wZW0KCiMgRGVwbG95IHRoZSBjb21wb3NlciBrZXkgYW5kIGNlcnRpZmljYXRlLgovdXNyL2xvY2FsL2Jpbi9hd3Mgc2VjcmV0c21hbmFnZXIgZ2V0LXNlY3JldC12YWx1ZSBcCiAgLS1zZWNyZXQtaWQgJHtXT1JLRVJfU1NMX0tFWVNfQVJOfSB8IGpxIC1yICIuU2VjcmV0U3RyaW5nIiA+IC90bXAvd29ya2VyX2tleXMuanNvbgpqcSAtciAiLndvcmtlcl9rZXkiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1rZXkucGVtCmpxIC1yICIud29ya2VyX2NydCIgL3RtcC93b3JrZXJfa2V5cy5qc29uIHwgYmFzZTY0IC1kIC0gPiAke0NPTVBPU0VSX0RJUn0vd29ya2VyLWNydC5wZW0Kcm0gLWYgL3RtcC93b3JrZXJfa2V5cy5qc29uCgojIFByZXBhcmUgb3NidWlsZC1jb21wb3NlcidzIHJlbW90ZSB3b3JrZXIgc2VydmljZXMgYW5kIHNvY2tldHMuCnN5c3RlbWN0bCBlbmFibGUgLS1ub3cgb3NidWlsZC1yZW1vdGUtd29ya2VyQCR7Q09NUE9TRVJfSE9TVH06ODcwMAoK" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210118193754715800000002" -> (known after apply)
      ~ id                                  = "sfr-cbbbac71-b09a-4c4f-a335-24c571a7df71" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-04e6df10bd74694e7" -> null
              - version = "7" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-04e6df10bd74694e7"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210118193724064400000001" -> (known after apply)
      ~ id                                  = "sfr-d13a6c7d-8d89-4eeb-ae29-251789490cf1" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0aae9d85fdd3f7067" -> null
              - version = "8" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0aae9d85fdd3f7067"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-2490098597" -> (known after apply)
      ~ instance_id = "i-0e1e6f91d3e3bc80a" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-837377960" -> (known after apply)
      ~ instance_id = "i-0f70dbd733fc559f9" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*